Repository: batden/eflete
Catalog: po/*.po
Languages: ta

source: Sets the edit mode for a textblock part to one of the following:<br>* NONE<br>* PLAIN<br>* EDITABLE<br>* PASSWORD<br>It causes the part be editable if the Edje object has the keyboard focus and the part has the Edje focus (or selectable always regardless of focus). In the password mode, the text is not selectable, but it can be edited and pasted, and all text characters are replaced with *s.
ta: உரைநடை பகுதிக்கான திருத்து பயன்முறையை பின்வருவனவற்றில் ஒன்றிற்கு அமைக்கிறது: <br>* எதுவுமில்லை <br>* எளிய <br>* திருத்தக்கூடிய <br>* கடவுச்சொல் <br> EDJE பொருளில் விசைப்பலகை இருந்தால் அது பகுதியைத் திருத்தக்கூடியதாக இருக்கும் கவனம் மற்றும் பகுதி EDJE கவனம் செலுத்துகிறது (அல்லது கவனம் செலுத்துவதைப் பொருட்படுத்தாமல் தேர்ந்தெடுக்கக்கூடியது). கடவுச்சொல் பயன்முறையில், உரை தேர்ந்தெடுக்கப்படவில்லை, ஆனால் அதைத் திருத்தி ஒட்டலாம், மேலும் அனைத்து உரை எழுத்துக்களும் *கள் மூலம் மாற்றப்படுகின்றன.

source: Sets the cursor mode for a textblock part to one of the following: UNDER cursor mode means the cursor draws below the character pointed at. This is the default mode. BEFORE cursor mode means the cursor is drawn as a vertical line before the current character, just like many other GUI toolkits handle it.
ta: உரைநடை பகுதிக்கு கர்சர் பயன்முறையை பின்வருவனவற்றில் அமைக்கிறது: கர்சர் பயன்முறையின் கீழ் கர்சர் சுட்டிக்காட்டப்பட்ட எழுத்துக்கு கீழே ஈர்க்கிறது. இது இயல்புநிலை பயன்முறை. கர்சர் பயன்முறைக்கு முன், கர்சர் தற்போதைய எழுத்துக்கு முன் செங்குத்து கோட்டாக வரையப்படுகிறது, பல GUI கருவித்தொகுப்புகள் அதைக் கையாளுகின்றன.

source: It causes a textblock that is editable to allow multiple lines for editing.
ta: இது திருத்துவதற்கு பல வரிகளை அனுமதிக்க திருத்தக்கூடிய ஒரு உரைதாரத்தை ஏற்படுத்துகிறது.

source: Used for the group to be loaded and the selection display under the selected text.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் தேர்ந்தெடுக்கப்பட்ட உரையின் கீழ் தேர்வு காட்சி.

source: Used for the group to be loaded and the selection display over the selected text.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் தேர்ந்தெடுக்கப்பட்ட உரையின் மீது தேர்வு காட்சி.

source: Used for the group to be loaded and the cursor display under the cursor position.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் கர்சர் நிலையின் கீழ் கர்சர் காட்சி.

source: Used for the group to be loaded and the cursor display over the cursor position.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் கர்சர் நிலைக்கு மேல் கர்சர் காட்சி.

source: Used for the group to be loaded and the anchors display under the anchor position.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் நங்கூரங்கள் நங்கூர நிலையின் கீழ் காண்பிக்கப்படும்.

source: Used for the group to be loaded and the anchor display over the anchor position.
ta: குழுவை ஏற்றுவதற்கு பயன்படுத்தப்படுகிறது மற்றும் நங்கூரம் நங்கூரம் நிலைக்கு மேல் காட்சி.

source: When the displayed object's size is smaller (or bigger) than its container, this property moves it relatively along the X axis inside its container. 0.0 means left and top edges of the object touching container's respective ones, while 1.0 stands for right and bottom edges of the object on horizonal axis. The default value is 0.5.
ta: காட்டப்படும் பொருளின் அளவு அதன் கொள்கலனை விட சிறியதாக (அல்லது பெரியது) இருக்கும்போது, இந்த சொத்து அதன் கொள்கலனுக்குள் ஃச் அச்சில் ஒப்பீட்டளவில் நகரும். . இயல்புநிலை மதிப்பு 0.5 ஆகும்.

source: When the displayed object's size is smaller (or bigger) than its container, this property moves it relatively along the Y axis inside its container. 0.0 means left and top edges of the object touching container's respective ones, while 1.0 stands for right and bottom edges of the object on vertical axis. The default value is 0.5.
ta: காட்டப்படும் பொருளின் அளவு அதன் கொள்கலனை விட சிறியதாக (அல்லது பெரியது) இருக்கும்போது, இந்த சொத்து அதன் கொள்கலனுக்குள் ஒய் அச்சுடன் ஒப்பீட்டளவில் நகரும். 0.0 என்பது பொருளின் இடது மற்றும் மேல் விளிம்புகள் கொள்கலனின் அந்தந்தவற்றைத் தொடும், அதே நேரத்தில் 1.0 என்பது செங்குத்து அச்சில் பொருளின் வலது மற்றும் கீழ் விளிம்புகளுக்கு நிற்கிறது. இயல்புநிலை மதிப்பு 0.5 ஆகும்.

source: elm/image/icon/start-point
ta: எல்ம்/படம்/ஐகான்/ச்டார்ட்-பாயிண்ட்

source: Causes the left-up corner to be positioned relatively to the X axis of another part's container. Affects the first parameter of "relative". Setting to NONE unsets this value for inherited parts.
ta: இடது-அப் மூலையை மற்றொரு பகுதியின் கொள்கலனின் ஃச் அச்சுடன் ஒப்பீட்டளவில் நிலைநிறுத்துகிறது. "உறவினர்" இன் முதல் அளவுருவை பாதிக்கிறது. எவரையும் அமைப்பது மரபணு பகுதிகளுக்கு இந்த மதிப்பை அழுத்தவில்லை.

source: Causes the left-up corner to be positioned relatively to the Y axis of another part's container. Affects the first parameter of "relative". Setting to NONE unsets this value for inherited parts.
ta: இடது-அப் மூலையை மற்றொரு பகுதியின் கொள்கலனின் ஒய் அச்சுடன் ஒப்பீட்டளவில் நிலைநிறுத்துகிறது. "உறவினர்" இன் முதல் அளவுருவை பாதிக்கிறது. எந்தவொரு அமைப்பையும் மரபுரிமையாக பகுதிகளுக்கு இந்த மதிப்பை அமைக்கவில்லை.

source: elm/image/icon/align
ta: எல்ம்/படம்/ஐகான்/சீரமை

source: Moves the left-up corner to a relative position inside the container of the relative "to" part. Values from 0.0 (0%, beginning) to 1.0 (100%, end) of the X axis.
ta: இடது மூலையை உறவினரின் கொள்கலனுக்குள் ஒரு உறவினர் நிலைக்கு நகர்த்துகிறது "" ஒரு பகுதியை ". ஃச் அச்சின் 0.0 (0%, தொடக்க) முதல் 1.0 (100%, முடிவு) வரை மதிப்புகள்.

source: Moves the left-up corner to a relative position inside the container of the relative "to" part. Values from 0.0 (0%, beginning) to 1.0 (100%, end) of the Y axis.
ta: இடது மூலையை உறவினரின் கொள்கலனுக்குள் ஒரு உறவினர் நிலைக்கு நகர்த்துகிறது "" ஒரு பகுதியை ". ஒய் அச்சின் 0.0 (0%, தொடக்க) முதல் 1.0 (100%, முடிவு) வரை மதிப்புகள்.

source: elm/image/icon/offset
ta: எல்ம்/படம்/ஐகான்/ஆஃப்செட்

source: Affects the left-up corner position for a fixed number of pixels along the X axis.
ta: ஃச் அச்சில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கான இடது-அப் மூலையில் நிலையை பாதிக்கிறது.

source: Affects the left-up corner position for a fixed number of pixels along the Y axis.
ta: ஒய் அச்சுடன் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கான இடது-அப் மூலையில் நிலையை பாதிக்கிறது.

source: elm/image/icon/end-point
ta: எல்ம்/படம்/ஐகான்/எண்ட்-பாயிண்ட்

source: Causes the right-down corner to be positioned relatively to the X axis of another part's container. Affects the first parameter of "relative". Setting to NONE unsets this value for inherited parts.
ta: வலது-கீழ் மூலையை மற்றொரு பகுதியின் கொள்கலனின் ஃச் அச்சுடன் ஒப்பீட்டளவில் நிலைநிறுத்துகிறது. "உறவினர்" இன் முதல் அளவுருவை பாதிக்கிறது. எந்தவொரு அமைப்பையும் மரபுரிமையாக பகுதிகளுக்கு இந்த மதிப்பை அமைக்கவில்லை.

source: Causes the right-down corner to be positioned relatively to the Y axis of another part's container. Affects the first parameter of "relative". Setting to NONE unsets this value for inherited parts.
ta: வலது-கீழ் மூலையை மற்றொரு பகுதியின் கொள்கலனின் ஒய் அச்சுடன் ஒப்பீட்டளவில் நிலைநிறுத்துகிறது. "உறவினர்" இன் முதல் அளவுருவை பாதிக்கிறது. எந்தவொரு அமைப்பையும் மரபுரிமையாக பகுதிகளுக்கு இந்த மதிப்பை அமைக்கவில்லை.

source: Moves the right-down corner to a relative position inside the container of the relative "to" part. Values from 0.0 (0%, beginning) to 1.0 (100%, end) of the X axis.
ta: வலது-கீழ் மூலையை உறவினரின் கொள்கலனுக்குள் ஒரு உறவினர் நிலைக்கு நகர்த்துகிறது. ஃச் அச்சின் 0.0 (0%, தொடக்க) முதல் 1.0 (100%, முடிவு) வரை மதிப்புகள்.

source: Moves the right-down corner to a relative position inside the container of the relative "to" part. Values from 0.0 (0%, beginning) to 1.0 (100%, end) of the Y axis.
ta: வலது-கீழ் மூலையை உறவினரின் கொள்கலனுக்குள் ஒரு உறவினர் நிலைக்கு நகர்த்துகிறது. ஒய் அச்சின் 0.0 (0%, தொடக்க) முதல் 1.0 (100%, முடிவு) வரை மதிப்புகள்.

source: Affects the right-down corner position for a fixed number of pixels along the X axis.
ta: ஃச் அச்சில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கான வலது-கீழ் மூலையில் நிலையை பாதிக்கிறது.

source: Affects the right-down corner position for a fixed number of pixels along the Y axis.
ta: ஒய் அச்சுடன் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கான வலது-கீழ் மூலையில் நிலையை பாதிக்கிறது.

source: Name of vector to be used.
ta: பயன்படுத்த வேண்டிய திசையன் பெயர்.

source: Name of image to be used. In an animation, this is the first and last image displayed.
ta: பயன்படுத்த வேண்டிய படத்தின் பெயர். ஒரு அனிமேசனில், இது காண்பிக்கப்படும் முதல் மற்றும் கடைசி படம்.

source: Names of the images to be used in an animation loop. You can have none, 1, or multiple tween declarations. Images are displayed in the order they are listed, during the transition to the state they are declared in. The "normal" image is the final state.
ta: அனிமேசன் வளையத்தில் பயன்படுத்தப்பட வேண்டிய படங்களின் பெயர்கள். உங்களிடம் எதுவும் இல்லை, 1, அல்லது பல இருபது அறிவிப்புகள் இருக்க முடியாது. படங்கள் அவை பட்டியலிடப்பட்ட வரிசையில், அவை அறிவிக்கப்பட்ட நிலைக்கு மாற்றத்தின் போது காட்டப்படும். "சாதாரண" படம் இறுதி நிலை.

source: If set, the area (in pixels) of each side of the image is displayed as a fixed size border, from the side inwards, preventing the corners from being changed on a resize.
ta: அமைக்கப்பட்டால், படத்தின் ஒவ்வொரு பக்கத்தின் பரப்பளவு (பிக்சல்களில்) ஒரு நிலையான அளவு எல்லையாக, பக்கவாட்டில் இருந்து உள்நோக்கி காட்டப்படும், இது ஒரு மறுஅளவிடத்தில் மூலைகளை மாற்றுவதைத் தடுக்கிறது.

source: If the border is set, this value tells Edje if the rest of the image (not covered by the defined border) is displayed or not or assumed to be solid (without alpha).
ta: எல்லை அமைக்கப்பட்டால், மீதமுள்ள படத்தை (வரையறுக்கப்பட்ட எல்லையால் மூடப்படவில்லை) காட்டப்பட்டாலும் இல்லாவிட்டால் அல்லது திடமானதாகக் கருதப்படுகிறதா (ஆல்பா இல்லாமல்) இந்த மதிப்பு EDJE ஐச் சொல்கிறது.

source: Sets the image fill type.<br>* SCALE - the image is scaled according to the params value "relative" and "offset" from "origin" and "size" blocks. This is the default type.<br> * TILE - the image is tiled accordingly params value "relative" and "offset" from "origin" and "size" blocks.
ta: பட நிரப்பு வகையை அமைக்கிறது. இது இயல்புநிலை வகை. <br> * ஓடு - படம் அதற்கேற்ப குலுங்குகிறது.

source: The smooth property takes a boolean value to decide if the image is smoothed on scaling or not.
ta: மென்மையான சொத்து ஒரு பூலியன் மதிப்பை எடுக்கும், படம் அளவிடுதலில் மென்மையாக்கப்பட்டதா இல்லையா என்பதை தீர்மானிக்க.

source: Sets the left-up corner X coordinate relative to the displayed element's content.
ta: காட்டப்பட்ட உறுப்பின் உள்ளடக்கத்துடன் ஒப்பிடும்போது இடது-அப் மூலையில் ஃச் ஒருங்கிணைப்பை அமைக்கிறது.

source: Sets the left-up corner Y coordinate relative to the displayed element's content.
ta: காட்டப்பட்ட உறுப்பின் உள்ளடக்கத்துடன் ஒப்பிடும்போது இடது-அப் மூலையில் ஒய் ஒருங்கிணைப்பை அமைக்கிறது.

source: Affects the left-up corner for a fixed number of pixels along the X axis.
ta: ஃச் அச்சில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கு இடது-அப் மூலையை பாதிக்கிறது.

source: Affects the left-up corner for a fixed number of pixels along the Y axis.
ta: ஒய் அச்சில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கு இடது-அப் மூலையை பாதிக்கிறது.

source: Sets the right-bottom corner X coordinate relative to the displayed element's content.
ta: காட்டப்பட்ட உறுப்பின் உள்ளடக்கத்துடன் ஒப்பிடும்போது வலது-கீழ் மூலையில் ஃச் ஒருங்கிணைப்பை அமைக்கிறது.

source: Sets the right-bottom corner Y coordinate relative to the displayed element's content.
ta: காட்டப்பட்ட உறுப்பின் உள்ளடக்கத்துடன் தொடர்புடைய வலது-கீழ் மூலையில் ஒய் ஒருங்கிணைப்பை அமைக்கிறது.

source: Affects the right-bottom corner for a fixed number of pixels along the X axis.
ta: ஃச் அச்சில் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கு வலது-கீழ் மூலையை பாதிக்கிறது.

source: Affects the right-bottom corner for a fixed number of pixels along the Y axis.
ta: ஒய் அச்சுடன் ஒரு குறிப்பிட்ட எண்ணிக்கையிலான பிக்சல்களுக்கு வலது-கீழ் மூலையை பாதிக்கிறது.

source: The part uses the color values of the chosen color class. These values can be overridden by the "color", "color2" and "color3" properties set below.
ta: பகுதி தேர்ந்தெடுக்கப்பட்ட வண்ண வகுப்பின் வண்ண மதிப்புகளைப் பயன்படுத்துகிறது. இந்த மதிப்புகள் கீழே அமைக்கப்பட்ட "கலர்", "கலர் 2" மற்றும் "கலர் 3" பண்புகளால் மீறப்படலாம்.

source: Sets the main color.
ta: முக்கிய வண்ணத்தை அமைக்கிறது.

source: Sets the text outline color.
ta: உரை அவுட்லைன் வண்ணத்தை அமைக்கிறது.

source: Sets the text shadow color.
ta: உரை நிழல் நிறத்தை அமைக்கிறது.

source: Sets the default content of a text part. Normally the application is the one changing its value.
ta: உரை பகுதியின் இயல்புநிலை உள்ளடக்கத்தை அமைக்கிறது. பொதுவாக பயன்பாடு அதன் மதிப்பை மாற்றுவதாகும்.

source: Changes the position on the X axis of the point of balance inside the container.
ta: கொள்கலனுக்குள் சமநிலையின் புள்ளியின் ஃச் அச்சில் நிலையை மாற்றுகிறது.

source: Changes the position on the Y axis of the point of balance inside the container.
ta: கொள்கலனுக்குள் சமநிலையின் புள்ளியின் ஒய் அச்சில் நிலையை மாற்றுகிறது.

source: When this parameter is enabled, it forces the minimum width of the container to be equal to the minimum size of the text.
ta: இந்த அளவுரு இயக்கப்பட்டால், இது கொள்கலனின் குறைந்தபட்ச அகலத்தை உரையின் குறைந்தபட்ச அளவிற்கு சமமாக இருக்கும்படி கட்டாயப்படுத்துகிறது.

source: When this parameter is enabled, it forces the minimum height of the container to be equal to the minimum size of the text.
ta: இந்த அளவுரு இயக்கப்பட்டால், இது கொள்கலனின் குறைந்தபட்ச உயரத்தை உரையின் குறைந்தபட்ச அளவிற்கு சமமாக இருக்க கட்டாயப்படுத்துகிறது.

source: When this parameter is enabled, it forces the maximum width of the container to be equal to the maximum size of the text.
ta: இந்த அளவுரு இயக்கப்பட்டால், இது கொள்கலனின் அதிகபட்ச அகலத்தை உரையின் அதிகபட்ச அளவிற்கு சமமாக இருக்கும்படி கட்டாயப்படுத்துகிறது.

source: When this parameter is enabled, it forces the maximum height of the container to be equal to the maximum size of the text.
ta: இந்த அளவுரு இயக்கப்பட்டால், இது கொள்கலனின் அதிகபட்ச உயரத்தை உரையின் அதிகபட்ச அளவிற்கு சமமாக இருக்கும்படி கட்டாயப்படுத்துகிறது.

source: This sets the font family to one of the aliases. Can be overrided by the application.
ta: இது எழுத்துரு குடும்பத்தை மாற்றுப்பெயருக்கு அமைக்கிறது. பயன்பாட்டால் மீறலாம்.

source: Sets the default font size in points for the text part. Can be overrided by the application.
ta: உரை பகுதிக்கான புள்ளிகளில் இயல்புநிலை எழுத்துரு அளவை அமைக்கிறது. பயன்பாட்டால் மீறப்படலாம்.

source: When this parameter is enabled, Edje resizes the text width to fit in it's container.
ta: இந்த அளவுரு இயக்கப்பட்டால், எட்சே உரை அகலத்தை அதன் கொள்கலனில் பொருத்துவதற்கு மறுஅளவிடுகிறது.

source: When this parameter is enabled, Edje resizes the text height to fit in it's container.
ta: இந்த அளவுரு இயக்கப்பட்டால், எட்சே அதன் கொள்கலனில் பொருந்தும் வகையில் உரை உயரத்தை மறுஅளவிடுகிறது.

source: Causes the part to use the text properties (such as font and size) of another part and update them as they change.
ta: மற்றொரு பகுதியின் உரை பண்புகளை (எழுத்துரு மற்றும் அளவு போன்றவை) பயன்படுத்தவும், அவை மாறும்போது அவற்றை புதுப்பிக்கவும் காரணமாகிறது.

source: Causes the part to display the text content of another part and update them as they change.
ta: மற்றொரு பகுதியின் உரை உள்ளடக்கத்தைக் காண்பிப்பதற்கும் அவை மாறும்போது அவற்றைப் புதுப்பிப்பதற்கும் இந்த பகுதி காரணமாகிறது.

source: This parameter enables or disables the ability to apply ellipsis to the text.
ta: இந்த அளவுரு உரைக்கு நீள்வட்டத்தைப் பயன்படுத்தும் திறனை செயல்படுத்துகிறது அல்லது முடக்குகிறது.

source: Used to balance the text in a relative point from 0.0 to 1.0, this point is the last section of the string to be cut out in case of a resize that is smaller than the text itself. The default value is 0.0.
ta: உரையை 0.0 முதல் 1.0 வரை உறவினர் புள்ளியில் சமப்படுத்தப் பயன்படுகிறது, இந்த புள்ளி உரையை விட சிறியதாக இருக்கும் ஒரு மறுஅளவிடுதலின் போது வெட்டப்பட வேண்டிய சரத்தின் கடைசி பகுதியாகும். இயல்புநிலை மதிப்பு 0.0 ஆகும்.

source: Causes the part to use the default style and tags with the specified name.
ta: குறிப்பிட்ட பெயருடன் இயல்புநிலை பாணி மற்றும் குறிச்சொற்களைப் பயன்படுத்துவதற்கு பகுதி காரணமாகிறது.

source: Changes the position of the point of balance by the X axis inside the container.
ta: கொள்கலனுக்குள் உள்ள ஃச் அச்சு மூலம் சமநிலை புள்ளியின் நிலையை மாற்றுகிறது.

source: Changes the position of the point of balance by the Y axis inside the container.
ta: கொள்கலனுக்குள் உள்ள ஒய் அச்சால் சமநிலை புள்ளியின் நிலையை மாற்றுகிறது.

source: Sets the space between cells by the X axis in pixels.
ta: பிக்சல்களில் ஃச் அச்சால் கலங்களுக்கு இடையில் இடத்தை அமைக்கிறது.

source: Sets the space between cells by the Y axis in pixels.
ta: பிக்சல்களில் ஒய் அச்சால் உயிரணுக்களுக்கு இடையில் இடத்தை அமைக்கிறது.

source: When this parameter is enabled, it forces the minimum horizonal size of the box/table to be equal to the minimum horizonal size of the items.
ta: இந்த அளவுரு இயக்கப்பட்டால், இது பெட்டியின் குறைந்தபட்ச கிடைமட்ட அளவை/அட்டவணையில் உருப்படிகளின் குறைந்தபட்ச கிடைமட்ட அளவிற்கு சமமாக இருக்கும்படி கட்டாயப்படுத்துகிறது.

source: When this parameters is enabled, it forces the minimum vertical size of the box/table to be equal to the minimum vertical size of the items.
ta: இந்த அளவுருக்கள் இயக்கப்பட்டால், இது பெட்டியின் குறைந்தபட்ச செங்குத்து அளவை/அட்டவணையின் குறைந்தபட்ச செங்குத்து அளவிற்கு சமமாக இருக்கும்படி கட்டாயப்படுத்துகிறது.

source: Sets the homogeneous mode for the table.
ta: அட்டவணைக்கான ஒரேவிதமான பயன்முறையை அமைக்கிறது.

source: Sets the name of the object using the evas_object_name_set() function.
ta: EVAS_OBJECT_NAME_SET () செயல்பாட்டைப் பயன்படுத்தி பொருளின் பெயரை அமைக்கிறது.

source: Sets the group this object is made from.
ta: இந்த பொருள் தயாரிக்கப்பட்ட குழுவை அமைக்கிறது.

source: Sets the minimum size hints of width for this object.
ta: இந்த பொருளின் அகலத்தின் குறைந்தபட்ச அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the minimum size hints of height for this object.
ta: இந்த பொருளின் உயரத்தின் குறைந்தபட்ச அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the maximum size hints of width for this object.
ta: இந்த பொருளின் அகலத்தின் அதிகபட்ச அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the maximum size hints of height for this object.
ta: இந்த பொருளின் உயரத்தின் அதிகபட்ச அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the prederred size hints of width for this object.
ta: இந்த பொருளுக்கு அகலத்தின் விருப்பமான அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the prederred size hints of height for this object.
ta: இந்த பொருளுக்கு உயரத்தின் விருப்பமான அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the alignment size hints for this object by X axis.
ta: இந்த பொருளின் சீரமைப்பு அளவு குறிப்புகளை ஃச் அச்சு மூலம் அமைக்கிறது.

source: Sets the alignment size hints for this object by Y axis.
ta: ஒய் அச்சு மூலம் இந்த பொருளுக்கான சீரமைப்பு அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the weight size hints for this object by X axis.
ta: இந்த பொருளின் எடை அளவு குறிப்புகளை ஃச் அச்சு மூலம் அமைக்கிறது.

source: Sets the weight size hints for this object by Y axis.
ta: ஒய் அச்சு மூலம் இந்த பொருளுக்கான எடை அளவு குறிப்புகளை அமைக்கிறது.

source: Sets the aspect control hints for this object.
ta: இந்த பொருளுக்கான அம்சக் கட்டுப்பாட்டு குறிப்புகளை அமைக்கிறது.

source: Sets the aspect width hints for this object.
ta: இந்த பொருளுக்கான அம்ச அகல குறிப்புகளை அமைக்கிறது.

source: Sets the aspect height hints for this object.
ta: இந்த பொருளுக்கான அம்ச உயர குறிப்புகளை அமைக்கிறது.

source: Replicates the item in a rectangle with a given amount of rows starting from the defined position of this item.
ta: இந்த உருப்படியின் வரையறுக்கப்பட்ட நிலையிலிருந்து தொடங்கி ஒரு குறிப்பிட்ட அளவு வரிசைகளைக் கொண்ட ஒரு செவ்வகத்தில் உருப்படியை பிரதிபலிக்கிறது.

source: Replicates the item in a rectangle with a given amount of columns starting from the defined position of this item.
ta: இந்த உருப்படியின் வரையறுக்கப்பட்ட நிலையிலிருந்து தொடங்கி ஒரு குறிப்பிட்ட அளவு நெடுவரிசைகளுடன் ஒரு செவ்வகத்தில் உருப்படியை பிரதிபலிக்கிறது.

source: Sets the left padding hints for this object.
ta: இந்த பொருளுக்கு இடது திணிப்பு குறிப்புகளை அமைக்கிறது.

source: Sets the right padding hints for this object.
ta: இந்த பொருளுக்கான சரியான திணிப்பு குறிப்புகளை அமைக்கிறது.

source: Sets the top padding hints for this object.
ta: இந்த பொருளுக்கான மேல் திணிப்பு குறிப்புகளை அமைக்கிறது.

source: Sets the bottom padding hints for this object.
ta: இந்த பொருளுக்கான கீழ் திணிப்பு குறிப்புகளை அமைக்கிறது.

source: Sets how many rows this item uses.
ta: இந்த உருப்படி எத்தனை வரிசைகளைப் பயன்படுத்துகிறது என்பதை அமைக்கிறது.

source: Sets how many columns this item uses
ta: இந்த உருப்படி எத்தனை நெடுவரிசைகளைப் பயன்படுத்துகிறது என்பதை அமைக்கிறது

source: Sets the row position this item has in the table.
ta: இந்த உருப்படி அட்டவணையில் உள்ள வரிசை நிலையை அமைக்கிறது.

source: Sets the column position this item has in the table.
ta: இந்த உருப்படி அட்டவணையில் வைத்திருக்கும் நெடுவரிசை நிலையை அமைக்கிறது.

source: Symbolic name of program as a unique identifier.
ta: ஒரு தனித்துவமான அடையாளங்காட்டியாக நிரலின் குறியீட்டு பெயர்.

source: Action to be performed by the program.
ta: திட்டத்தால் செய்யப்பட வேண்டிய செயல்.

source: Specifies the signal that causes the program to run.The received signal must match the specified source to run. Signals can be globbed, but only 1 signal keyword per program may be used, for example: "mouse,clicked,"; (clicking any mouse button that matches source starts program).Edje provides the following global signals:<br>hold,on; hold,off;<br>mouse,in; mouse,out; mouse,pressed,in; mouse,pressed,out;<br>mouse,down,N: where N - mouse button number;<br>mouse,down,N,double: where N - mouse button number;<br>mouse,down,N,triple: where N - mouse button number;<br>mouse,up,N: where N - mouse button number;<br>mouse,clicked,N: where N - mouse button number;<br>mouse,move;<br>mouse,wheel,N,M: where N - the direction (by default is 0), M - 1 if wheel scrolled up and -1 if down;<br>drag,start; drag; drag,stop;<br>focus,part,in; focus,part,out.<bd>
ta: நிரலை இயக்கும் சமிக்ஞையை குறிப்பிடுகிறது. பெறப்பட்ட சமிக்ஞை குறிப்பிட்ட மூலத்துடன் இயங்க வேண்டும். சமிக்ஞைகள் உலகளாவிய செய்யப்படலாம், ஆனால் ஒரு நிரலுக்கு 1 சமிக்ஞை முக்கிய சொல் மட்டுமே பயன்படுத்தப்படலாம், எடுத்துக்காட்டாக: "சுட்டி, சொடுக்கு செய்யப்பட்டது,"; . பிடி, ஆஃப்; <br> சுட்டி, இல்; சுட்டி, அவுட்; சுட்டி, அழுத்தியது, இல்; சுட்டி, அழுத்தியது, வெளியே; <br> சுட்டி, கீழே, என்: எங்கே என் - மவுச் பொத்தான் எண்; . சுட்டி, சக்கரம், என், எம்: எங்கே என் - திசை (இயல்பாகவே 0), எம் - 1 சக்கரம் உருட்டினால் மற்றும் -1 கீழே இருந்தால்; <br> இழுத்து, தொடங்கு; இழுத்தல்; இழுக்கவும், நிறுத்தவும்; <br> கவனம், பகுதி, இல்; கவனம், பகுதி, வெளியே. <bd>

source: Source of the accepted signal. Sources can be globbed, but only 1 source keyword per program can be used. For example: "button-*"; (Signals from any part or program named "button-*" are accepted).
ta: ஏற்றுக்கொள்ளப்பட்ட சமிக்ஞையின் சான்று. ஆதாரங்கள் உலகளாவிய செய்யப்படலாம், ஆனால் ஒரு நிரலுக்கு 1 மூல முக்கிய சொல் மட்டுமே பயன்படுத்த முடியும். எடுத்துக்காட்டாக: "பொத்தான்-*"; ("பொத்தான்-*" என்ற பெயரிடப்பட்ட எந்த பகுதி அல்லது நிரலிலிருந்து சமிக்ஞைகள் ஏற்றுக்கொள்ளப்படுகின்றன).

source: Wait 'from' seconds before executing the program.
ta: நிரலை இயக்குவதற்கு முன் 'வினாடிகளில் இருந்து' காத்திருங்கள்.

source: Add a number of seconds (from 0 to 'range') to the total waiting time.
ta: மொத்த காத்திருப்பு நேரத்திற்கு பல வினாடிகள் (0 முதல் 'வரம்பு' வரை) சேர்க்கவும்.

source: Filter signals to be only accepted if the part [part] is in state named [state]. Only 1 filter per program can be used. If [state] is not given, the source of the event is used instead.
ta: பகுதி [பகுதி] [மாநிலம்] என்று பெயரிடப்பட்டிருந்தால் மட்டுமே ஏற்றுக்கொள்ள வேண்டிய வடிகட்டி சமிக்ஞைகள். ஒரு நிரலுக்கு 1 வடிகட்டி மட்டுமே பயன்படுத்த முடியும். [நிலை] கொடுக்கப்படாவிட்டால், அதற்கு பதிலாக நிகழ்வின் மூலத்தைப் பயன்படுத்தப்படுகிறது.

source: Switch the part state from the current to the given.
ta: பகுதி நிலையை மின்னோட்டத்திலிருந்து கொடுக்கப்பட்டதாக மாற்றவும்.

source: State index
ta: மாநில அட்டவணை
