Repository: batden/eflete
Catalog: po/*.po
Languages: ta

source: program emit source changed from "%s" to "%s"
ta: நிரல் உமிழ்வு மூலமானது "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program state changed from "%s" to "%s"
ta: நிரல் நிலை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program source changed from "%s" to "%s"
ta: நிரல் மூலமானது "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program in.from changed from %.2f to %.2f
ta: நிரல் in.from %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program in.range changed from %.2f to %.2f
ta: நிரல் in.range %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition time changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் நேரம் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition factor changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் காரணி %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition gradient changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் சாய்வு %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition decay changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் சிதைவு %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition bounces changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் பவுன்ச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition swings changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் ஊசலாட்டம் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition bezier_x1 changed from %.2f to %.2f
ta: நிரலின் மாற்றம் பெசியர்_எக்ச் 1 %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition bezier_y1 changed from %.2f to %.2f
ta: திட்டத்தின் மாற்றம் பெசியர்_ஒய் 1 %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition bezier_x2 changed from %.2f to %.2f
ta: நிரலின் மாற்றம் பெசியர்_எக்ச் 2 %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's transition bezier_y2 changed from %.2f to %.2f
ta: நிரலின் மாற்றம் பெசியர்_ஒய் 2 %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's tone duration changed from %.2f to %.2f
ta: நிரலின் தொனி காலம் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program's sample changed from "%s" to "%s"
ta: நிரலின் மாதிரி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program's tone changed from "%s" to "%s"
ta: நிரலின் தொனி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program's channel changed from "%s" to "%s"
ta: நிரலின் சேனல் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program's sample speed changed from %.2f to %.2f
ta: நிரலின் மாதிரி விரைவு %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program drag value x changed from %.2f to %.2f
ta: நிரல் இழுவை மதிப்பு ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program drag value y changed from %.2f to %.2f
ta: நிரல் இழுவை மதிப்பு ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: program value changed from %.2f to %.2f
ta: நிரல் மதிப்பு %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: filter part changed from "%s" to "%s"
ta: வடிகட்டி பகுதி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: filter state changed from "%s" to "%s"
ta: வடிகட்டி நிலை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: container's align_x changed from %.2f to %.2f
ta: கொள்கலனின் சீரமைப்பு_எக்ச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: container's align_y changed from %.2f to %.2f
ta: கொள்கலனின் சீரமைப்பு_ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: container's padding_x changed from %d to %d
ta: கொள்கலனின் திணிப்பு_எக்ச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: container's padding_y changed from %d to %d
ta: கொள்கலனின் திணிப்பு_ஒய் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: container's min_x %s
ta: கொள்கலனின் min_x %s

source: container's min_y %s
ta: கொள்கலனின் min_y %s

source: table homogeneous changed from "%s" to "%s"
ta: அட்டவணை ஒரேவிதமான "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: item's source changed from "%s" to "%s"
ta: உருப்படியின் மூலமானது "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: part item's min_w changed from %d to %d
ta: பகுதி உருப்படியின் min_w %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's min_h changed from %d to %d
ta: பகுதி உருப்படியின் min_h %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's max_w changed from %d to %d
ta: பகுதி உருப்படியின் MAX_W %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's max_h changed from %d to %d
ta: பகுதி உருப்படியின் MAX_H %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's prefer_w changed from %d to %d
ta: பகுதி உருப்படியின் விருப்பம் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's prefer_h changed from %d to %d
ta: பகுதி உருப்படியின் விருப்பம் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's weight_x changed from %.2f to %.2f
ta: பகுதி உருப்படியின் எடை_எக்ச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: part item's weight_y changed from %.2f to %.2f
ta: பகுதி உருப்படியின் எடை_ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: part item's align_x changed from %.2f to %.2f
ta: பகுதி உருப்படியின் சீரமைப்பு_எக்ச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: part item's align_y changed from %.2f to %.2f
ta: பகுதி உருப்படியின் சீரமைப்பு_ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: part item's aspect mode changed from "%s" to "%s"
ta: பகுதி உருப்படியின் அம்ச முறை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program's transition type changed from "%s" to "%s"
ta: திட்டத்தின் மாற்றம் வகை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: part item's aspect_w changed from %d to %d
ta: பகுதி உருப்படியின் அம்சம்_டபிள்யூ %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's aspect_h changed from %d to %d
ta: பகுதி உருப்படியின் அம்சம்_எச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's spread by rows changed from %d to %d
ta: பகுதி உருப்படி வரிசைகளால் பரவியது %d முதல் %d வரை மாற்றப்பட்டது

source: part item's spread by columns changed from %d to %d
ta: பகுதி உருப்படி நெடுவரிசைகளால் பரவியது %d முதல் %d வரை மாற்றப்பட்டது

source: part item's span by columns changed from %hu to %hu
ta: நெடுவரிசைகளால் பகுதி உருப்படியின் இடைவெளி %hu இலிருந்து %hu ஆக மாற்றப்பட்டது

source: part item's span by rows changed from %hu to %hu
ta: வரிசைகளின் பகுதி உருப்படியின் இடைவெளி %hu இலிருந்து %hu ஆக மாற்றப்பட்டது

source: part item's column position changed from %hu to %hu
ta: பகுதி உருப்படியின் நெடுவரிசை நிலை %hu இலிருந்து %hu ஆக மாற்றப்பட்டது

source: part item's row position changed from %hu to %hu
ta: பகுதி உருப்படியின் வரிசை நிலை %hu இலிருந்து %hu ஆக மாற்றப்பட்டது

source: part item's left padding changed from %d to %d
ta: பகுதி உருப்படியின் இடது திணிப்பு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's right padding changed from %d to %d
ta: பகுதி உருப்படியின் வலது திணிப்பு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's top padding changed from %d to %d
ta: பகுதி உருப்படியின் மேல் திணிப்பு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part item's bottom padding changed from %d to %d
ta: பகுதி உருப்படியின் கீழ் திணிப்பு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: map's perspective part changed from "%s" to "%s"
ta: வரைபடத்தின் முன்னோக்கு பகுதி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: map's light part changed from "%s" to "%s"
ta: வரைபடத்தின் ஒளி பகுதி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: map %s
ta: வரைபடம் %s

source: map perspective %s
ta: வரைபட முன்னோக்கு %s

source: map smooth %s
ta: வரைபடம் மென்மையான %s

source: map alpha %s
ta: வரைபட ஆல்பா %s

source: map backface cull %s
ta: வரைபட பேக்ஃபேச் கல் %s

source: perspective focal changed from %d to %d
ta: முன்னோக்கு குவியல் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: perspective zplane changed from %d to %d
ta: முன்னோக்கு Zplane %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: map's rotation center part changed from "%s" to "%s"
ta: வரைபடத்தின் சுழற்சி மைய பகுதி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: map rotation x changed from %.2f to %.2f
ta: வரைபட சுழற்சி ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: map rotation y changed from %.2f to %.2f
ta: வரைபட சுழற்சி ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: map rotation z changed from %.2f to %.2f
ta: வரைபட சுழற்சி சட் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: point color '1' changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: புள்ளி வண்ணம் '1' [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d க்கு மாற்றப்பட்டது]

source: point color '2' changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: புள்ளி வண்ணம் '2' [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d க்கு மாற்றப்பட்டது]

source: point color '3' changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: புள்ளி நிறம் '3' [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d] ஆக மாற்றப்பட்டது]

source: point color '4' changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: புள்ளி வண்ணம் '4' [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d க்கு மாற்றப்பட்டது]

source: Circular dependency alarm! Selected group somehow related to current group.
ta: வட்ட சார்பு அலாரம்! தேர்ந்தெடுக்கப்பட்ட குழு எப்படியாவது தற்போதைய குழுவுடன் தொடர்புடையது.

source: turned on
ta: இயக்கப்பட்டது

source: turned off
ta: அணைக்கப்பட்டது

source: The name to be used by the application to load the resulting Edje object and to identify the group to swallow in a GROUP part.
ta: இதன் விளைவாக வரும் EDJE பொருளை ஏற்றவும், குழு பகுதியில் விழுங்க குழுவை அடையாளம் காணவும் பயன்பாட்டால் பயன்படுத்தப்பட வேண்டிய பெயர்.

source: The minimum width for the container defined by the composition of the parts. This value is not enforced.
ta: பகுதிகளின் கலவையால் வரையறுக்கப்பட்ட கொள்கலனுக்கான குறைந்தபட்ச அகலம். இந்த மதிப்பு செயல்படுத்தப்படவில்லை.

source: The minimum height for the container defined by the composition of the parts. This value is not enforced.
ta: பகுதிகளின் கலவையால் வரையறுக்கப்பட்ட கொள்கலனுக்கான குறைந்தபட்ச உயரம். இந்த மதிப்பு செயல்படுத்தப்படவில்லை.

source: The maximum width for the container defined by the composition of the parts. This value is not enforced.
ta: பகுதிகளின் கலவையால் வரையறுக்கப்பட்ட கொள்கலனுக்கான அதிகபட்ச அகலம். இந்த மதிப்பு செயல்படுத்தப்படவில்லை.

source: The maximum height for the container defined by the composition of the parts. This value is not enforced.
ta: பகுதிகளின் கலவையால் வரையறுக்கப்பட்ட கொள்கலனுக்கான அதிகபட்ச உயரம். இந்த மதிப்பு செயல்படுத்தப்படவில்லை.

source: The part name is used as a reference in the relative<bt>positioning system of the theme, by programs and in some cases by the application. It must be unique within the group.
ta: பகுதி பெயர் கருப்பொருளின் உறவினர் <bt> பொருத்துதல் அமைப்பில், நிரல்கள் மற்றும் சில சந்தர்ப்பங்களில் பயன்பாட்டின் மூலம் பயன்படுத்தப்படுகிறது. இது குழுவிற்குள் தனித்துவமாக இருக்க வேண்டும்.

source: Specifies whether the part scales its size with an Edje scaling factor. By default, the scale is off and the default scale factor is 1.0 - that means no scaling. This is used to scale properties, such as font size, and minimum and maximum size of the part. It can also be used to scale based on the DPI of the target device. The reason to be selective is that some things work well being scaled, and others do not, so the designer gets to choose what works best.
ta: பகுதி அதன் அளவை EDJE அளவிடுதல் காரணியுடன் அளவிடுகிறதா என்பதைக் குறிப்பிடுகிறது. இயல்பாக, அளவு முடக்கப்பட்டுள்ளது மற்றும் இயல்புநிலை அளவிலான காரணி 1.0 ஆகும் - அதாவது அளவிடுதல் இல்லை. எழுத்துரு அளவு மற்றும் பகுதியின் குறைந்தபட்ச மற்றும் அதிகபட்ச அளவு போன்ற பண்புகளை அளவிட இது பயன்படுத்தப்படுகிறது. இலக்கு சாதனத்தின் டிபிஐ அடிப்படையில் அளவிடவும் இது பயன்படுத்தப்படலாம். தேர்ந்தெடுக்கப்பட்டதற்கான காரணம் என்னவென்றால், சில விசயங்கள் நன்றாக அளவிடப்படுகின்றன, மற்றவை அவ்வாறு செய்யாது, எனவே வடிவமைப்பாளர் சிறப்பாகச் செயல்படுவதைத் தேர்வு செய்கிறார்.

source: Specifies whether the part emits signals. Disabling it prevents the part from emitting any type of signal at all.
ta: பகுதி சமிக்ஞைகளை வெளியிடுகிறதா என்பதைக் குறிப்பிடுகிறது. அதை முடக்குவது பகுதியை எந்த வகையான சமிக்ஞையையும் வெளியிடுவதைத் தடுக்கிறது.

source: Specifies whether a part echoes a mouse event to other parts below the pointer.
ta: சுட்டிக்காட்டி கீழே உள்ள மற்ற பகுதிகளுக்கு ஒரு பகுதி ஒரு சுட்டி நிகழ்வை எதிரொலிக்கிறதா என்பதைக் குறிப்பிடுகிறது.

source: Only renders the area of the part that coincides with another part's container. The overflowing content is not displayed. Note that the part being clipped to canbe a rectangle or image part.
ta: மற்றொரு பகுதியின் கொள்கலனுடன் ஒத்துப்போகும் பகுதியின் பகுதியை மட்டுமே வழங்குகிறது. நிரம்பி வழியும் உள்ளடக்கம் காட்டப்படாது. ஒரு செவ்வகம் அல்லது படப் பகுதியை நிர்வகிக்க பகுதி கிளிப் செய்யப்படுகிறது என்பதை நினைவில் கொள்க.

source: Specifies whether events with the given flags must be ignored. These events do not have their signals emitted to the parts.
ta: கொடுக்கப்பட்ட கொடிகளுடன் நிகழ்வுகள் புறக்கணிக்கப்பட வேண்டுமா என்பதைக் குறிப்பிடுகிறது. இந்த நிகழ்வுகள் அவற்றின் சமிக்ஞைகளை பகுதிகளுக்கு வெளிப்படுத்தவில்லை.

source: Sets the mouse pointer behavior for the part. The default value is AUTOGRAB. The following modes are available: * AUTOGRAB, when the part is clicked and the button remains pressed, the part is the source of all future mouse signals emitted, even outside the object, until the button is released. * NOGRAB, the effect is limited to the part's container.
ta: பகுதிக்கு சுட்டி சுட்டிக்காட்டி நடத்தை அமைக்கிறது. இயல்புநிலை மதிப்பு ஆட்டோகிராப் ஆகும். பின்வரும் முறைகள் கிடைக்கின்றன: * ஆட்டோகிராப், பகுதி சொடுக்கு செய்து பொத்தானை அழுத்தும் போது, பொத்தானை வெளியிடும் வரை, பொருளுக்கு வெளியே கூட உமிழப்படும் அனைத்து எதிர்கால சுட்டி சமிக்ஞைகளின் மூலமும் இந்த பகுதி. * நோகிராப், இதன் விளைவு பகுதியின் கொள்கலனுக்கு மட்டுமே.

source: The meaning of this parameter varies depending on the type of the part. * For GROUP parts, it's the name of another group in the Edje file which is autoloaded and swallowed on this part. * For TEXTBLOCK parts, it's the name of a group is used for selection display under the text.
ta: இந்த அளவுருவின் பொருள் பகுதியின் வகையைப் பொறுத்து மாறுபடும். * குழு பகுதிகளுக்கு, இது EDJE கோப்பில் உள்ள மற்றொரு குழுவின் பெயர், இது இந்த பகுதியில் தன்னியக்க ஏற்றப்பட்டு விழுங்கப்படுகிறது. * டெக்ச்ட்ப்ளாக் பகுதிகளுக்கு, இது ஒரு குழுவின் பெயர் உரையின் கீழ் தேர்வு காட்சிக்கு பயன்படுத்தப்படுகிறது.

source: Enables or disables dragging along the X axis. When enabled, 1 sets the starting point at 0.0 and -1 at 1.0.
ta: ஃச் அச்சில் இழுவை செயல்படுத்துகிறது அல்லது முடக்குகிறது. இயக்கப்பட்டால், 1 தொடக்க புள்ளியை 0.0 ஆகவும், -1 ஐ 1.0 ஆகவும் அமைக்கிறது.

source: Enables or disables dragging along the Y axis. When enabled, 1 sets the starting point at 0.0 and -1 at 1.0.
ta: ஒய் அச்சில் இழுப்பதை செயல்படுத்துகிறது அல்லது முடக்குகிறது. இயக்கப்பட்டால், 1 தொடக்க புள்ளியை 0.0 ஆகவும், -1 ஐ 1.0 ஆகவும் அமைக்கிறது.

source: This parameter takes any integer and limits movement to values divisible by it, causing the part to jump from position to position. If the step is set to 0, it is calculated as the width of the confined part divided by count.
ta: இந்த அளவுரு எந்தவொரு முழு எண்ணையும் எடுத்து இயக்கத்தை அதன் மூலம் வகுக்கக்கூடிய மதிப்புகளுக்கு கட்டுப்படுத்துகிறது, இதனால் அந்த பகுதி நிலையிலிருந்து நிலைக்குச் செல்ல காரணமாகிறது. படி 0 என அமைக்கப்பட்டால், அது வரையறுக்கப்பட்ட பகுதியின் அகலமாக கணக்கிடப்படுகிறது.

source: When set, limits the movement of the movable part to another part's container. When you use the confine option, do not forget to set a minimum size for the part, or the movable part does not show up.
ta: அமைக்கப்பட்டால், நகரக்கூடிய பகுதியின் இயக்கத்தை மற்றொரு பகுதியின் கொள்கலனுக்கு கட்டுப்படுத்துகிறது. நீங்கள் வரையறுக்கப்பட்ட விருப்பத்தைப் பயன்படுத்தும்போது, பகுதிக்கு குறைந்தபட்ச அளவை அமைக்க மறக்காதீர்கள், அல்லது நகரக்கூடிய பகுதி காண்பிக்கப்படாது.

source: When set, the movement of the dragged part can only start when it gets moved enough to be outside of the threshold part.
ta: அமைக்கும்போது, இழுத்துச் செல்லப்பட்ட பகுதியின் இயக்கம் வாசல் பகுதிக்கு வெளியே இருக்க போதுமானதாக இருக்கும்போது மட்டுமே தொடங்க முடியும்.

source: Causes the part to forward the drag events to another part, thus ignoring them for itself.
ta: இழுவை நிகழ்வுகளை வேறொரு பகுதிக்கு அனுப்புவதற்கு இந்த பகுதி காரணமாகிறது, இதனால் அவற்றைப் புறக்கணிக்கிறது.

source: A name used to identify a description inside a given part. Multiple descriptions are used to declare different states of the same part, such as "clicked" or "invisible". All state declarations are also coupled with an index number between 0.0 and 1.0.
ta: கொடுக்கப்பட்ட பகுதிக்குள் ஒரு விளக்கத்தை அடையாளம் காண பயன்படுத்தப்படும் பெயர். "சொடுக்கு" அல்லது "கண்ணுக்கு தெரியாத" போன்ற ஒரே பகுதியின் வெவ்வேறு நிலைகளை அறிவிக்க பல விளக்கங்கள் பயன்படுத்தப்படுகின்றன. அனைத்து மாநில அறிவிப்புகளும் 0.0 முதல் 1.0 வரை குறியீட்டு எண்ணுடன் இணைக்கப்பட்டுள்ளன.

source: Takes a boolean state specifying whether the part is visible or not. Invisible parts do not emit signals.
ta: பகுதி காணப்படுகிறதா இல்லையா என்பதைக் குறிப்பிடும் ஒரு பூலியன் நிலையை எடுக்கும். கண்ணுக்கு தெரியாத பாகங்கள் சமிக்ஞைகளை வெளியிடுவதில்லை.

source: Causes the part to use another part content as the content of this part.
ta: இந்த பகுதியின் உள்ளடக்கமாக மற்றொரு பகுதி உள்ளடக்கத்தை பகுதி பயன்படுத்துகிறது.

source: Sets the minimum width for this state.
ta: இந்த நிலைக்கு குறைந்தபட்ச அகலத்தை அமைக்கிறது.

source: Sets the minimum height for this state.
ta: இந்த நிலைக்கு குறைந்தபட்ச உயரத்தை அமைக்கிறது.

source: Sets the maximum width for this state.
ta: இந்த நிலைக்கு அதிகபட்ச அகலத்தை அமைக்கிறது.

source: Sets the maximum height for this state.
ta: இந்த நிலைக்கு அதிகபட்ச உயரத்தை அமைக்கிறது.

source: A width multiplier forcibly applied to whatever the minimum size is only during minimum size calculation.
ta: குறைந்தபட்ச அளவு கணக்கீட்டின் போது மட்டுமே குறைந்தபட்ச அளவு எதுவாக இருந்தாலும் ஒரு அகல பெருக்கி வலுக்கட்டாயமாகப் பயன்படுத்தப்படுகிறது.

source: A height multiplier forcibly applied to whatever the minimum size is only during minimum size calculation.
ta: குறைந்தபட்ச அளவு கணக்கீட்டின் போது மட்டுமே குறைந்தபட்ச அளவு எதுவாக இருந்தாலும் ஒரு உயர பெருக்கி வலுக்கட்டாயமாகப் பயன்படுத்தப்படுகிறது.

source: Tells the minimum size calculation routine that this part does not change size in width. ON for enabled OFF for disabled. When enabled, the routine does not try and expand or contract the part.
ta: இந்த பகுதி அகலத்தில் அளவை மாற்றாது என்று குறைந்தபட்ச அளவு கணக்கீட்டு வழக்கத்தை சொல்கிறது. முடக்கப்பட்டதாக இயக்கப்பட்டது. இயக்கப்பட்டால், வழக்கம் பகுதியை முயற்சித்து விரிவுபடுத்தவோ அல்லது சுருக்கவோ செய்யாது.

source: Tells the minimum size calculation routine that this part does not change size in height. ON for enabled OFF for disabled. When enabled, the routine does not try and expand or contract the part.
ta: இந்த பகுதி உயரத்தில் அளவை மாற்றாது என்று குறைந்தபட்ச அளவு கணக்கீட்டு வழக்கத்தை சொல்கிறது. முடக்கப்பட்டதாக இயக்கப்பட்டது. இயக்கப்பட்டால், வழக்கம் பகுதியை முயற்சித்து விரிவுபடுத்தவோ அல்லது சுருக்கவோ செய்யாது.

source: Sets the scope of the "aspect" property to a given dimension.
ta: கொடுக்கப்பட்ட பரிமாணத்திற்கு "நற்பொருத்தம்" சொத்தின் நோக்கத்தை அமைக்கிறது.

source: Normally the width and height can be resized to any values independently. The aspect property forces the width to height ratio to be kept from the minimum.
ta: பொதுவாக அகலம் மற்றும் உயரத்தை எந்த மதிப்புகளுக்கும் சுயாதீனமாக மாற்றியமைக்க முடியும். நற்பொருத்தம் சொத்து அகலத்தை உயர விகிதத்திற்கு குறைந்தபட்சத்திலிருந்து வைக்க கட்டாயப்படுத்துகிறது.

source: Normally the width and height can be resized to any values independently. The aspect property forces the width to height ratio to be kept to the maximum.
ta: பொதுவாக அகலம் மற்றும் உயரத்தை எந்த மதிப்புகளுக்கும் சுயாதீனமாக மாற்றியமைக்க முடியும். அம்ச சொத்து அகலத்தை உயர விகிதத்திற்கு அதிகபட்சமாக வைக்க கட்டாயப்படுத்துகிறது.

source: Enables or disables mapping for the part.
ta: பகுதிக்கு மேப்பிங்கை இயக்குகிறது அல்லது முடக்குகிறது.

source: Enables or disables perspective when rotating.
ta: சுழலும் போது முன்னோக்கை செயல்படுத்துகிறது அல்லது முடக்குகிறது.

source: Enables or disables smooth map rendering. This can be linear interpolation, anisotropic filtering, or anything the engine decides is "smooth".
ta: மென்மையான வரைபட வழங்குதல் செயல்படுத்துகிறது அல்லது முடக்குகிறது. இது நேரியல் இடைக்கணிப்பு, அனிசோட்ரோபிக் வடிகட்டுதல் அல்லது இயந்திரம் தீர்மானிக்கும் எதையும் "மென்மையானது".

source: Enables or disables the alpha channel when rendering the map.
ta: வரைபடத்தை வழங்கும்போது ஆல்பா சேனலை செயல்படுத்துகிறது அல்லது முடக்குகிறது.

source: Enables or disables backface culling (such as when the rotated part that normally faces the camera is facing away after being rotated). This means that the object is hidden when "backface culled"
ta: பேக்ஃபேச் குறட்டை இயக்குகிறது அல்லது முடக்குகிறது (பொதுவாக கேமராவை எதிர்கொள்ளும் சுழலும் பகுதி சுழற்றப்பட்ட பிறகு எதிர்கொள்ளும் போது). இதன் பொருள் "பேக்ஃபேச் குறைக்க" போது பொருள் மறைக்கப்படுகிறது

source: Sets the part that is used as the "perspective point" for giving a part a "3d look". The perspective point must have a perspective section that provides the zplane and focal properties.
ta: ஒரு பகுதி A "3D தோற்றத்தை" வழங்குவதற்கான "முன்னோக்கு புள்ளியாக" பயன்படுத்தப்படும் பகுதியை அமைக்கிறது. முன்னோக்கு புள்ளி ZPLANE மற்றும் குவிய பண்புகளை வழங்கும் ஒரு முன்னோக்கு பகுதியைக் கொண்டிருக்க வேண்டும்.

source: Sets the part that is used as the "light" for calculating the brightness (based on how directly the part's surface is facing the light source point)
ta: பிரகாசத்தைக் கணக்கிடுவதற்கு "ஒளி" ஆகப் பயன்படுத்தப்படும் பகுதியை அமைக்கிறது (பகுதியின் மேற்பரப்பு ஒளி மூல புள்ளியை எவ்வாறு எதிர்கொள்கிறது என்பதை அடிப்படையாகக் கொண்டு)

source: Sets the distance from the focal z plane (zplane) and the camera.
ta: ஃபோகல் சட் வானூர்தி (ZPLANE) மற்றும் கேமராவிலிருந்து தூரத்தை அமைக்கிறது.

source: Sets the z value that is not scaled.
ta: அளவிடப்படாத சட் மதிப்பை அமைக்கிறது.

source: Sets the part that is used as the center of rotation when rotating the part with this description.
ta: இந்த விளக்கத்துடன் பகுதியை சுழற்றும்போது சுழற்சியின் மையமாகப் பயன்படுத்தப்படும் பகுதியை அமைக்கிறது.

source: Rotation (in degrees) around the X axis of the part considering the center set.
ta: மையத் தொகுப்பைக் கருத்தில் கொண்டு பகுதியின் ஃச் அச்சில் சுழற்சி (டிகிரிகளில்).

source: Rotation (in degrees) around the Y axis of the part considering the center set.
ta: மையத் தொகுப்பைக் கருத்தில் கொண்டு பகுதியின் ஒய் அச்சில் சுழற்சி (டிகிரிகளில்).

source: Rotation (in degrees) around the Z axis of the part considering the center set.
ta: மையத் தொகுப்பைக் கருத்தில் கொண்டு பகுதியின் சட் அச்சில் சுழற்சி (டிகிரிகளில்).

source: Sets the color of a vertex in the map.This control changes the left-top point of a part.
ta: வரைபடத்தில் ஒரு வெர்டெக்சின் நிறத்தை அமைக்கிறது. இந்த கட்டுப்பாடு ஒரு பகுதியின் இடது-மேல் புள்ளியை மாற்றுகிறது.

source: Sets the color of a vertex in the map. This control changes the right-top point of a part.
ta: வரைபடத்தில் ஒரு வெர்டெக்சின் நிறத்தை அமைக்கிறது. இந்த கட்டுப்பாடு ஒரு பகுதியின் வலது மேல் புள்ளியை மாற்றுகிறது.

source: Sets the color of a vertex in the map.This control changes the left-bottom point of a part.
ta: வரைபடத்தில் ஒரு வெர்டெக்சின் நிறத்தை அமைக்கிறது. இந்த கட்டுப்பாடு ஒரு பகுதியின் இடது கீழ் புள்ளியை மாற்றுகிறது.

source: Sets the color of a vertex in the map. This control changes the right-bottom point of a part.
ta: வரைபடத்தில் ஒரு வெர்டெக்சின் நிறத்தை அமைக்கிறது. இந்த கட்டுப்பாடு ஒரு பகுதியின் வலது கீழ் புள்ளியை மாற்றுகிறது.

source: Causes Edje to draw the selected effect.
ta: தேர்ந்தெடுக்கப்பட்ட விளைவை எட்சே வரைய காரணமாகிறது.

source: Shadow directions.
ta: நிழல் திசைகள்.

source: Sets the selection mode for a textblock part to one of the following: The DEFAULT selection mode is what you expect on any desktop. Press mouse, drag, and release to end. The EXPLICIT mode requires the application controlling the Edje object has to explicitly begin and end selection modes, and the selection itself is draggable at both ends.
ta: உரைநடை பகுதிக்கான தேர்வு பயன்முறையை பின்வருவனவற்றில் ஒன்றிற்கு அமைக்கிறது: இயல்புநிலை தேர்வு முறை எந்த டெச்க்டாப்பிலும் நீங்கள் எதிர்பார்க்கிறீர்கள். சுட்டி, இழுத்து, முடிவுக்கு வெளியீடு. வெளிப்படையான பயன்முறையில் EDJE பொருளைக் கட்டுப்படுத்தும் பயன்பாடு தேவைப்படுகிறது, தேர்வு முறைகளை வெளிப்படையாகத் தொடங்க வேண்டும் மற்றும் முடிக்க வேண்டும், மேலும் தேர்வு இரண்டு முனைகளிலும் இழுக்கக்கூடியது.
