Repository: batden/eflete
Catalog: po/*.po
Languages: ta

source: Export to file '%s' successfull
ta: '%s' வெற்றிக்கு ஏற்றுமதி

source: Color class name:
ta: வண்ண வகுப்பு பெயர்:

source: Type new color class name here
ta: புதிய வண்ண வகுப்பு பெயரை இங்கே தட்டச்சு செய்க

source: Create a new layout
ta: புதிய தளவமைப்பை உருவாக்கவும்

source: Colorclass is used in:
ta: ColorClass இதில் பயன்படுத்தப்படுகிறது:

source: <br>group: %s<br>part: %s<br>state: "%s" %2.1f
ta: <br> குழு: %s <br> பகுதி: %s <br> மாநிலம்: " %s" %2.1f

source: Search
ta: தேடல்

source: Color class manager
ta: வண்ண வகுப்பு மேலாளர்

source: Preview
ta: முன்னோட்டம்

source: Color classes list
ta: வண்ண வகுப்புகள் பட்டியல்

source: The quick brown fox jumps over the lazy dog
ta: விரைவான பழுப்பு நரி சோம்பேறி நாய் மீது குதிக்கிறது

source: Failed initialize colorclasses manager
ta: தோல்வியுற்றது ColorClasses மேலாளரைத் தொடங்கவும்

source: Unable to add a folder
ta: ஒரு கோப்புறையைச் சேர்க்க முடியவில்லை

source: Add new image into set
ta: புதிய படத்தை தொகுப்பில் சேர்க்கவும்

source: File not exist
ta: கோப்பு இல்லை

source: Unable to add folder
ta: கோப்புறையைச் சேர்க்க முடியவில்லை

source: File exist
ta: கோப்பு உள்ளது

source: Choose image
ta: படத்தைத் தேர்வுசெய்க

source: Image set name:
ta: பட தொகுப்பு பெயர்:

source: Type a new image set name
ta: புதிய பட தொகுப்பு பெயரைத் தட்டச்சு செய்க

source: Create a new image set
ta: புதிய பட தொகுப்பை உருவாக்கவும்

source: Image
ta: படம்

source: Image Set
ta: படத் தொகுப்பு

source: Vectors
ta: திசையன்கள்

source: Image manager
ta: பட மேலாளர்

source: Image Gallery
ta: பட கேலரி

source: Image set
ta: படத் தொகுப்பு

source: UNKNOWN
ta: தெரியவில்லை

source: Sound Samples
ta: ஒலி மாதிரிகள்

source: Sound Tones
ta: ஒலி டோன்கள்

source: File '%s' is not exist
ta: '%s' கோப்பு இல்லை

source: Sample '%s' is already added to project
ta: மாதிரி '%s' ஏற்கனவே திட்டத்தில் சேர்க்கப்பட்டுள்ளது

source: File '%s' exist
ta: கோப்பு '%s' உள்ளது

source: Choose a sound
ta: ஒலியைத் தேர்வுசெய்க

source: Tone name:
ta: தொனி பெயர்:

source: Type a new tone name
ta: புதிய தொனி பெயரைத் தட்டச்சு செய்க

source: Frequency:
ta: அதிர்வெண்:

source: Type a frequency (20 - 20000)
ta: ஒரு அதிர்வெண் (20 - 20000) தட்டச்சு செய்க

source: Create a new tone
ta: புதிய தொனியை உருவாக்கவும்

source: Sound manager
ta: ஒலி மேலாளர்

source: Sound Gallery
ta: ஒலி கேலரி

source: Sample
ta: மாதிரி

source: Tone
ta: தொனி

source: Style name:
ta: பாணி பெயர்:

source: Type a new style name
ta: புதிய பாணி பெயரைத் தட்டச்சு செய்க

source: Failed to add tag value. Tag will be deleted
ta: குறிச்சொல் மதிப்பைச் சேர்க்கத் தவறிவிட்டது. குறிச்சொல் நீக்கப்படும்

source: Add textblock style
ta: உரைதாரர் பாணியைச் சேர்க்கவும்

source: Type a new tag name.
ta: புதிய குறிச்சொல் பெயரைத் தட்டச்சு செய்க.

source: Add tag for style: %s
ta: பாணிக்கு குறிச்சொல்லைச் சேர்க்கவும்: %s

source: Textblock style manager
ta: டெக்ச்ட்ப்ளாக் பாணி மேலாளர்

source: Textblock styles list
ta: டெக்ச்ட்ப்ளாக் ச்டைல்கள் பட்டியல்

source: Style
ta: சூல் தண்டு

source: Tag
ta: குறிச்சொல்

source: Click to show vertical ctxpopup with icons and labels (3 items)
ta: சின்னங்கள் மற்றும் லேபிள்களுடன் (3 உருப்படிகள்) செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show vertical ctxpopup with icons and labels (30 items)
ta: ஐகான்கள் மற்றும் லேபிள்களுடன் (30 உருப்படிகள்) செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show vertical ctxpopup with icons and no labels (3 items)
ta: ஐகான்கள் மற்றும் லேபிள்கள் (3 உருப்படிகள்) உடன் செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show vertical ctxpopup with icons and no labels (30 items)
ta: ஐகான்கள் மற்றும் லேபிள்கள் (30 உருப்படிகள்) உடன் செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show vertical ctxpopup with labels and no icons (3 items)
ta: லேபிள்கள் மற்றும் ஐகான்கள் (3 உருப்படிகள்) உடன் செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show vertical ctxpopup with labels and no icons (30 items)
ta: லேபிள்கள் மற்றும் ஐகான்கள் (30 உருப்படிகள்) உடன் செங்குத்து CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show horizontal ctxpopup with icons and labels (3 items)
ta: ஐகான்கள் மற்றும் லேபிள்களுடன் (3 உருப்படிகள்) கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show horizontal ctxpopup with icons and labels (30 items)
ta: ஐகான்கள் மற்றும் லேபிள்களுடன் (30 உருப்படிகள்) கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show horizontal ctxpopup with icons and no labels (3 items)
ta: ஐகான்கள் மற்றும் லேபிள்கள் (3 உருப்படிகள்) உடன் கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show horizontal ctxpopup with icons and no labels (30 items)
ta: ஐகான்கள் மற்றும் லேபிள்கள் (30 உருப்படிகள்) உடன் கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Click to show horizontal ctxpopup with labels and no icons (3 items)
ta: லேபிள்களுடன் கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க மற்றும் சின்னங்கள் இல்லை (3 உருப்படிகள்)

source: Click to show horizontal ctxpopup with labels and no icons (30 items)
ta: லேபிள்கள் மற்றும் ஐகான்கள் (30 உருப்படிகள்) உடன் கிடைமட்ட CTXPOPUP ஐக் காட்ட சொடுக்கு செய்க

source: Could not load group '%s' from mapped file '%s'.
ta: வரைபடக் கோப்பிலிருந்து '%s' குழுவை ஏற்ற முடியவில்லை '%s'.

source: Some long text for our label, that islong but not too long.
ta: எங்கள் லேபிளுக்கு சில நீண்ட உரை, அந்த இச்லாங் ஆனால் மிக நீளமாக இல்லை.

source: No icons
ta: சின்னங்கள் இல்லை

source: Eflete
ta: எப்லெட்

source: Multi-
ta: பல

source: -button-
ta: -பட்டன்-

source: -entry
ta: -எண்டரி

source: Check
ta: சரிபார்

source: this
ta: இது

source: out
ta: வெளியே

source: Text1
ta: உரை 1

source: Tap and enter for adding buttons
ta: பொத்தான்களைச் சேர்ப்பதற்கு தட்டவும் உள்ளிடவும்

source: Back
ta: பின்

source: Page Next
ta: பக்கம் அடுத்து

source: Page Prev
ta: பக்க முந்தைய

source: Prev page
ta: முந்தைய பக்கம்

source: Next page
ta: அடுத்த பக்கம்

source: Page 1
ta: பக்கம் 1

source: Subtitle 1
ta: வசன வரிகள் 1

source: Main Page
ta: முதன்மை பக்கம்

source: Press to show Notify
ta: அறிவிப்பைக் காட்ட அழுத்தவும்

source: %1.1f units
ta: %1.1f அலகுகள்

source: Object
ta: பொருள்

source: Enabled
ta: இயக்கப்பட்டது

source: Disabled
ta: முடக்கப்பட்டது

source: User Text
ta: பயனர் உரை

source: Left
ta: இடது

source: Right
ta: வலது

source: Last saved: none
ta: கடைசியாக சேமிக்கப்பட்டது: எதுவுமில்லை

source: Project path: none
ta: திட்ட பாதை: எதுவுமில்லை

source: About
ta: பற்றி

source: About Component Designer
ta: கூறு வடிவமைப்பாளர் பற்றி

source: Global:<br><b>F1</b> - show shortcuts list (this dialog)<br><b>F2</b> - normal mode<br><b>F3</b> - code mode<br><b>F4</b> - demo mode<br><b>F7</b> - open image manager<br><b>F8</b> - open sound manager<br><b>F9</b> - open style manager<br><b>F10</b> - open colorclass manager<br><b>F11</b> - open script manager<br><b>ctrl + q</b> - quit<br><br>Workspace:<br><b>ctrl + s</b> - save<br><b>ctrl + z</b> - undo<br><b>ctrl + y</b> - redo<br><b>ctrl + n</b> - add new group<br><b>q</b> - add new part<br><b>w</b> - add new state<br><b>e</b> - add new item<br><b>r</b> - add new program<br><b>t</b> - add new data item<br><b>del</b> - delete selected part/state/item/program/data item<br><b>s</b> - select next state of active part<br><b>z</b> - select prev part<br><b>x</b> - select next part<br><b>ESC</b> - unselect<br><b>o</b> - show/hide object area<br><b>ctrl + wheel_up</b> / <b>KP_ADD</b> - zoom in<br><b>ctrl + wheel_down</b> / <b>KP_SUB</b> - zoom out<br><b>KP_DIV</b> - set zoom to 100%<br><br>Tabs:<br><b>ctrl + w</b> - close tab<br><b>ctrl + num</b> - switch to tab 1-10<br><b>tab</b> / <b>ctrl + pg_down</b> - switch to next tab<br><b>shift + tab</b> / <b>ctrl + pg_up</b> - switch to prev tab<br><br>Popups:<br><b>Enter</b> - OK<br><b>ESC</b> - cancel<br>
ta: உலகளாவிய: <br> <b> f1 </b> - குறுக்குவழிகள் பட்டியலைக் காட்டு (இந்த உரையாடல்) <br> <b> f2 </b> - இயல்பான பயன்முறை <br> <b> f3 </b> - குறியீடு பயன்முறை < br> <b> f4 </b> - டெமோ பயன்முறை <br> <b> f7 </b> - பட மேலாளரைத் திறக்கவும் <br> <b> f8 </b> - திறந்த ஒலி மேலாளரைத் திறக்கவும் <br> <b> f9 </b> - திறந்த பாணி மேலாளர் <br> <b> f10 </b> - வண்ணமயமான கிளாச் மேலாளரைத் திறக்கவும் <br> <b> f11 </b> - ச்கிரிப்ட் மேலாளரைத் திறக்கவும் <br> <b> கட்டுப்பாடு + q </b > - வெளியேறு <br> <br> பணியிடங்கள்: <br> <b> கட்டுப்பாடு + s </b> - சேமி <br> <b> கட்டுப்பாடு + சட் </b> - செயல்தவிர் <br> <b> கட்டுப்பாடு + ஒய் </b> - மீண்டும் <br> <b> கட்டுப்பாடு + n </b> - புதிய குழுவைச் சேர்க்கவும் <br> <b> q </b> - புதிய பகுதியைச் சேர்க்கவும் <br> <b> w </b> - புதிய நிலையைச் சேர்க்கவும் <br> <b> இ </b> - புதிய உருப்படியைச் சேர்க்கவும் <br> <b> ஆர் </b> - புதிய நிரலைச் சேர்க்கவும் <br> <b> டி </b> - புதிய தரவு உருப்படியைச் சேர்க்கவும் < br> <b> டெல் </b> - தேர்ந்தெடுக்கப்பட்ட பகுதி/நிலை/உருப்படி/நிரல்/தரவு உருப்படியை நீக்கு <br> <b> கள் </b> - செயலில் உள்ள பகுதியின் அடுத்த நிலையைத் தேர்ந்தெடுக்கவும் <br> <b> சட் </ b> - முந்தைய பகுதியைத் தேர்ந்தெடுக்கவும் <br> <b> ஃச் </b> - அடுத்த பகுதியைத் தேர்ந்தெடுக்கவும் <br> <b> தப்பி </b> - தேர்ந்தெடுக்கப்பட்ட <br> <b> o </b> - பொருளைக் காட்டு/மறைக்கவும் பகுதி <br> <b> கட்டுப்பாடு + wheel_up </b>/<b> kp_add </b> - <br> <b> கட்டுப்பாடு + wheel_down </b>/<b> kp_sub </b> - பெரிதாக்க வெளியே <br> <b> kp_div </b> - சூமை 100%ஆக அமைக்கவும் <br> <br> தாவல்கள்: <br> <b> கட்டுப்பாடு + w </b> - தாவலை மூடு <br> <b> கட்டுப்பாடு + எண் </b> - தாவலுக்கு மாறவும் <br> <b> தாவல் </b>/<b> கட்டுப்பாடு + pg_down </b> - அடுத்த தாவலுக்கு மாறவும் <br> <b> உயர்த்து + தாவல் </ b>/<b> கட்டுப்பாடு + pg_up </b> - முந்தைய தாவலுக்கு மாறவும் <br> <br> பாப்அப்கள்: <br> <b> உள்ளிடவும் </b> - சரி <br> <b> தப்பி </b> - ரத்துசெய் <br>

source: Help: shortcuts
ta: உதவி: குறுக்குவழிகள்

source: Sequence already binded.
ta: வரிசை ஏற்கனவே பிணைக்கப்பட்டுள்ளது.

source: Please press key sequence
ta: முக்கிய வரிசையை அழுத்தவும்

source: File
ta: கோப்பு

source: New project
ta: புதிய திட்டம்

source: Open project
ta: திறந்த திட்டம்

source: Import edj-file
ta: EDJ-FILE ஐ இறக்குமதி செய்க

source: Import edc-file
ta: EDC-FILE ஐ இறக்குமதி செய்க

source: Save
ta: சேமி

source: Export as edc
ta: EDC ஆக ஏற்றுமதி

source: Group
ta: குழு

source: Project
ta: திட்டம்

source: Export as edj
ta: EDJ ஆக ஏற்றுமதி

source: Develop
ta: உருவாக்கு

source: Release
ta: வெளியீடு

source: Close project
ta: மூடு திட்டத்தை மூடு

source: Quit
ta: வெளியேறு

source: Edit
ta: தொகு

source: Undo
ta: செயல்தவிர்

source: Redo
ta: மீண்டும்செய்

source: Add group
ta: குழுவைச் சேர்க்கவும்

source: Add part
ta: பகுதியைச் சேர்க்கவும்

source: Add state
ta: மாநிலத்தைச் சேர்க்கவும்

source: Add item
ta: உருப்படியைச் சேர்க்கவும்

source: Add program
ta: நிரலைச் சேர்க்கவும்

source: Add data item
ta: தரவு உருப்படியைச் சேர்க்கவும்

source: View
ta: பார்வை

source: Zoom in
ta: பெரிதாக்கு

source: Zoom out
ta: சிறிதாக்கு

source: Reset zoom
ta: பெரிதாக்கு மீட்டமைக்கவும்

source: Zoom to fit in Workspace
ta: பணியிடத்தில் பொருந்தக்கூடிய பெரிதாக்கு

source: Resize to fill workspace
ta: பணியிடத்தை நிரப்ப மறுஅளவிடுங்கள்

source: Show object area
ta: பொருள் பகுதியைக் காட்டு

source: Show rulers
ta: ஆட்சியாளர்களைக் காட்டு

source: Window
ta: சாளரம்

source: Home
ta: வீடு

source: Textblock styles manager
ta: டெக்ச்ட்ப்ளாக் ச்டைல்ச் மேலாளர்

source: Script manager
ta: ச்கிரிப்ட் மேலாளர்

source: Help
ta: உதவி

source: Shortcuts
ta: குறுக்குவழிகள்

source: Title will be deleted
ta: தலைப்பு நீக்கப்படும்

source: Ok
ta: சரி

source: Cancel
ta: ரத்துசெய்

source: Alias of
ta: மாற்றுப்பெயர்

source: Copy of
ta: நகல்

source: Name
ta: பெயர்

source: Alias
ta: மாற்றுப்பெயர்

source: None
ta: எதுவுமில்லை

source: Can't remove layout "%s"
ta: "%s" தளவமைப்பை அகற்ற முடியாது

source: Error
ta: பிழை

source: Warning: Delete layout
ta: எச்சரிக்கை: தளவமைப்பை நீக்கு

source: Can't delete the opened layout. Please, close the layout tab before delete it.
ta: திறந்த தளவமைப்பை நீக்க முடியாது. தயவுசெய்து, தளவமைப்பு தாவலை நீக்குவதற்கு முன் அதை மூடு.

source: Can't delete one of those opened layouts. Please, close the layout tab before delete it.
ta: திறந்த தளவமைப்புகளில் ஒன்றை நீக்க முடியாது. தயவுசெய்து, தளவமைப்பு தாவலை நீக்குவதற்கு முன் அதை மூடு.

source: Confirm delete layouts
ta: தளவமைப்புகளை நீக்கு என்பதை உறுதிப்படுத்தவும்

source: Are you sure you want to delete the selected layouts?<br>All aliases will be delete too.
ta: தேர்ந்தெடுக்கப்பட்ட தளவமைப்புகளை நீக்க விரும்புகிறீர்களா? <br> அனைத்து மாற்றுப்பெயர்களும் நீக்கப்படும்.

source: One or few of the aliases of this group are opened.Please, close the alias tab/tabs before delete it.
ta: இந்த குழுவின் ஒன்று அல்லது சில மாற்றங்கள் திறக்கப்படுகின்றன. தயவுசெய்து, அதை நீக்குவதற்கு முன் மாற்று தாவல்/தாவல்களை மூடு.

source: Confirm delete layout
ta: தளவமைப்பை நீக்கு என்பதை உறுதிப்படுத்தவும்

source: Are you sure you want to delete the selected layout?<br>All aliases will be delete too.
ta: தேர்ந்தெடுக்கப்பட்ட தளவமைப்பை நீக்க விரும்புகிறீர்களா? <br> அனைத்து மாற்றுப்பெயர்களும் நீக்கப்படும்.

source: Export source code
ta: மூலக் குறியீடு ஏற்றுமதி

source: Export develop edj
ta: ஏற்றுமதி உருவாக்கு EDJ

source: Project save
ta: திட்ட சேமிப்பு

source: Close project %s
ta: திட்டம் %s மூடு

source: Do you want to save changes?
ta: மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

source: Project close
ta: திட்ட நெருக்கமான

source: < Style manager >
ta: <ச்டைல் மேனேசர்>

source: < Sound manager >
ta: <ஒலி மேலாளர்>

source: < Color class manager >
ta: <வண்ண வகுப்பு மேலாளர்>

source: Specifies a program to run after the current<br>program completes. The source and signal parameters<br>of a program run as an "after" are ignored.
ta: தற்போதைய <br> நிரல் முடிந்ததும் இயக்க ஒரு நிரலைக் குறிப்பிடுகிறது. ஒரு நிரலின் மூல மற்றும் சமிக்ஞை அளவுருக்கள் <br> ஒரு "பின்" என இயங்கும் புறக்கணிக்கப்படுகின்றன.

source: Program or part on which the specified action acts.
ta: நிரல் அல்லது குறிப்பிட்ட செயல் செயல்படும் பகுதி.

source: group name changed from "%s" to "%s"
ta: குழு பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: state name changed from "%s" to "%s"
ta: மாநில பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program name changed from "%s" to "%s"
ta: நிரல் பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: part item's name changed from "%s" to "%s"
ta: பகுதி உருப்படியின் பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: image changed from "%s" to "%s"
ta: படம் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: vector changed from "%s" to "%s"
ta: திசையன் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: changed "%d" tween images
ta: "%d" இருபது படங்கள் மாற்றப்பட்டன

source: group.min_w changed from %d to %d
ta: group.min_w %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: group.min_h changed from %d to %d
ta: group.min_h %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: group.max_w changed from %d to %d
ta: group.max_w %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: group.max_h changed from %d to %d
ta: group.max_h %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: part name changed from "%s" to "%s"
ta: பகுதி பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: data item name changed from "%s" to "%s"
ta: தரவு உருப்படி பெயர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: data item value changed from "%s" to "%s"
ta: தரவு உருப்படி மதிப்பு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: part scale %s
ta: பகுதி அளவு %s

source: mouse events %s
ta: சுட்டி நிகழ்வுகள் %s

source: repeat events %s
ta: நிகழ்வுகள் %s

source: clip to changed from "%s" to "%s"
ta: கிளிப் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: proxy source changed from "%s" to "%s"
ta: பதிலாள் மூலமானது "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: ignore_flags changed from "%s" to "%s"
ta: புறக்கணிப்பு_ஃப்ளாக்ச் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: pointer mode changed from "%s" to "%s"
ta: சுட்டிக்காட்டி பயன்முறை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: select mode changed from "%s" to "%s"
ta: பயன்முறையைத் தேர்ந்தெடுக்கவும் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: entry mode changed from "%s" to "%s"
ta: நுழைவு முறை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: cursor mode changed from "%s" to "%s"
ta: கர்சர் பயன்முறை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: fill type changed from "%s" to "%s"
ta: நிரப்பு வகை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: text effect changed from "%s" to "%s"
ta: உரை விளைவு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: shadow direction changed from "%s" to "%s"
ta: நிழல் திசை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: dragable enable x changed from %d to %d
ta: இழுக்கக்கூடிய ஃச் ஃச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable enable y changed from %d to %d
ta: இழுக்கக்கூடிய செயலாக்க ஒய் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable step x changed from %d to %d
ta: இழுக்கக்கூடிய படி ஃச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable step y changed from %d to %d
ta: இழுக்கக்கூடிய படி %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable count x changed from %d to %d
ta: இழுக்கக்கூடிய எண்ணிக்கை ஃச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable count y changed from %d to %d
ta: இழுக்கக்கூடிய நாடு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: dragable confine changed from "%s" to "%s"
ta: இழுக்கக்கூடிய வரையறை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: dragable threshold changed from "%s" to "%s"
ta: இழுக்கக்கூடிய வாசல் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: dragable event changed from "%s" to "%s"
ta: இழுக்கக்கூடிய நிகழ்வு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: source changed from "%s" to "%s"
ta: மூல "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: selection under changed from "%s" to "%s"
ta: "%s" இலிருந்து "%s" ஆக மாற்றப்பட்ட தேர்வு

source: cursor under changed from "%s" to "%s"
ta: கர்சர் கீழ் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: anchors under changed from "%s" to "%s"
ta: கீழ் உள்ள நங்கூரங்கள் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டன

source: selection over changed from "%s" to "%s"
ta: தேர்வு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: cursor over changed from "%s" to "%s"
ta: கர்சர் ஓவர் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: anchors over changed from "%s" to "%s"
ta: நங்கூரர்கள் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டனர்

source: text source changed from "%s" to "%s"
ta: உரை மூலமானது "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: text text_source changed from "%s" to "%s"
ta: உரை உரை_சோர்ச் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: text style changed from "%s" to "%s"
ta: உரை பாணி "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: multiline %s
ta: மல்டிலின் %s

source: state visible %s
ta: மாநில புலப்படும் %s

source: fill smooth %s
ta: மென்மையான %s ஐ நிரப்பவும்

source: state min_w changed from %d to %d
ta: state min_w %d இலிருந்து %d ஆக மாறியது

source: state min_h changed from %d to %d
ta: state min_h %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: state minmul_w changed from %d to %d
ta: state minmul_w %d இலிருந்து %d ஆக மாறியது

source: state minmul_h changed from %d to %d
ta: state minmul_h %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: state fixed_w %s
ta: state youred_w %s

source: state fixed_h %s
ta: மாநில நிலையான_.எச் %s

source: state max_w changed from %d to %d
ta: மாநில MAX_W %d இலிருந்து %d ஆக மாறியது

source: state max_h changed from %d to %d
ta: மாநில MAX_H %d இலிருந்து %d ஆக மாறியது

source: state aspect_min changed from %.2f to %.2f
ta: மாநில அம்சம்_மின் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: state aspect_max changed from %.2f to %.2f
ta: மாநில அம்சம்_மேக்ச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: aspect preference changed from "%s" to "%s"
ta: அம்ச விருப்பம் "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: align x changed from %.2f to %.2f
ta: சீரமை ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: align y changed from %.2f to %.2f
ta: சீரமை ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: rel1 to_x changed from "%s" to "%s"
ta: REL1 TO_X "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: rel1 to_y changed from "%s" to "%s"
ta: Rel1 to_y "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: rel1 relative x changed from %.2f to %.2f
ta: REL1 உறவினர் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: rel1 relative y changed from %.2f to %.2f
ta: REL1 உறவினர் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: rel1 offset x changed from %d to %d
ta: REL1 ஆஃப்செட் ஃச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: rel1 offset y changed from %d to %d
ta: REL1 ஆஃப்செட் ஒய் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: rel2 to_x changed from "%s" to "%s"
ta: Rel2 to_x "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: rel2 to_y changed from "%s" to "%s"
ta: Rel2 to_y "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: rel2 relative x changed from %.2f to %.2f
ta: Rel2 உறவினர் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: rel2 relative y changed from %.2f to %.2f
ta: Rel2 உறவினர் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: rel2 offset x changed from %d to %d
ta: REL2 ஆஃப்செட் ஃச் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: rel2 offset y changed from %d to %d
ta: Rel2 ஆஃப்செட் ஒய் %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: image left border changed from %d to %d
ta: பட இடது எல்லை %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: image right border changed from %d to %d
ta: பட வலது எல்லை %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: image top border changed from %d to %d
ta: படத்தின் மேல் எல்லை %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: image bottom border changed from %d to %d
ta: படத்தின் கீழ் எல்லை %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: border fill changed from "%s" to "%s"
ta: எல்லை நிரப்பு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: fill origin relative x changed from %.2f to %.2f
ta: மூலத்தை நிரப்பவும் உறவினர் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: fill origin relative y changed from %.2f to %.2f
ta: மூலத்தை நிரப்பவும் உறவினர் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டார்

source: fill size relative x changed from %.2f to %.2f
ta: அளவு உறவினர் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: fill size relative y changed from %.2f to %.2f
ta: அளவு உறவினர் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டார்

source: fill origin offset x changed from %.2f to %.2f
ta: நிரப்புதல் ஆஃப்செட் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: fill origin offset y changed from %.2f to %.2f
ta: நிரப்புதல் ஆஃப்செட் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: fill size offset x changed from %.2f to %.2f
ta: அளவு ஆஃப்செட் ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: fill size offset y changed from %.2f to %.2f
ta: அளவு ஆஃப்செட் ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: color class changed from "%s" to "%s"
ta: வண்ண வகுப்பு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: color changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: வண்ணம் [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d க்கு மாற்றப்பட்டது]

source: outline color changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: அவுட்லைன் வண்ணம் [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d க்கு மாற்றப்பட்டது]

source: shadow color changed from [%d,%d,%d,%d] to [%d,%d,%d,%d]
ta: நிழல் நிறம் [%d,%d,%d,%d] இலிருந்து [%d,%d,%d,%d] ஆக மாற்றப்பட்டது.

source: text changed from "%s" to "%s"
ta: உரை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: font changed from "%s" to "%s"
ta: எழுத்துரு "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: text min_x %s
ta: உரை min_x %s

source: text min_y %s
ta: உரை min_y %s

source: text max_x %s
ta: உரை max_x %s

source: text max_y %s
ta: உரை MAX_Y %s

source: text fit_x %s
ta: உரை FIT_X %s

source: text fit_y %s
ta: உரை FIT_Y %s

source: program current %s
ta: நிரல் தற்போதைய %s

source: text align x changed from %.2f to %.2f
ta: உரை சீரமை ஃச் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: text align y changed from %.2f to %.2f
ta: உரை சீரமை ஒய் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: text size changed from %d to %d
ta: உரை அளவு %d இலிருந்து %d ஆக மாற்றப்பட்டது

source: text elipsis changed from %.2f to %.2f
ta: உரை நீள்வட்டம் %.2f இலிருந்து %.2f ஆக மாற்றப்பட்டது

source: text elipsis %s
ta: உரை நீள்வட்டம் %s

source: program signal changed from "%s" to "%s"
ta: நிரல் சமிக்ஞை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது

source: program emit signal changed from "%s" to "%s"
ta: நிரல் உமிழ்வு சமிக்ஞை "%s" இலிருந்து "%s" ஆக மாற்றப்பட்டது
