Repository: batden/eflete
Catalog: po/*.po
Languages: ta

source: Name of the signal to be emitted to the application on execution of this program.
ta: இந்த திட்டத்தின் செயல்படுத்தல் குறித்த பயன்பாட்டிற்கு வெளியிடப்பட வேண்டிய சமிக்ஞையின் பெயர்.

source: Name of the signal source to be emitted to the application on the execution of this program.
ta: இந்த திட்டத்தின் செயல்படுத்தல் குறித்த பயன்பாட்டிற்கு வெளியேற்றப்பட வேண்டிய சமிக்ஞை மூலத்தின் பெயர்.

source: Defines how transitions occur using the STATE_SET action.
ta: State_set செயலைப் பயன்படுத்தி மாற்றங்கள் எவ்வாறு நிகழ்கின்றன என்பதை வரையறுக்கிறது.

source: Causes the object to move from its current position.
ta: பொருள் அதன் தற்போதைய நிலையில் இருந்து நகரும்.

source: A double specifying the number of seconds in which to preform the transition.
ta: மாற்றத்தை முன்கூட்டியே வடிவமைக்கும் விநாடிகளின் எண்ணிக்கையை இரட்டிப்பாக்குகிறது.

source: ACCEL_FAC, DECEL_FAC and SIN_FAC need the extra optional value to determine the "factor" of curviness. 1.0 is the same as their non-factor counterparts, where 0.0 is equal to linear. Numbers higher than 1 make the curve angles steeper with a more pronounced curve point.
ta: வளைவின் "காரணி" தீர்மானிக்க Act_fac, decel_fac மற்றும் sin_fac ஆகியவை கூடுதல் விருப்ப மதிப்பு தேவை. 1.0 என்பது அவற்றின் காரணி அல்லாத சகாக்களுக்கு சமம், அங்கு 0.0 நேர்கோட்டுக்கு சமம். 1 ஐ விட அதிகமான எண்கள் வளைவு கோணங்களை அதிக வெளிப்படும் வளைவு புள்ளியுடன் செங்குத்தாக ஆக்குகின்றன.

source: Initial gradient start (0.0 is horizontal, 1.0 is diagonal (linear), 2.0 is twice the gradient of linear).
ta: ஆரம்ப சாய்வு தொடக்கமானது (0.0 கிடைமட்டமானது, 1.0 மூலைவிட்ட (நேரியல்), 2.0 என்பது நேரியல் சாய்வு இரு மடங்கு).

source: Determining how much the bounce decays, with 0.0 giving linear decay per bounce, and higher values giving much more decay.
ta: பவுன்ச் எவ்வளவு சிதைகிறது என்பதைத் தீர்மானித்தல், 0.0 ஒரு பவுன்ச் நேரியல் சிதைவைக் கொடுக்கும், மேலும் அதிக மதிப்புகள் அதிக சிதைவைக் கொடுக்கும்.

source: Number of bounces (rounded down to the nearest integer value)
ta: பவுன்ச் எண்ணிக்கை (அருகிலுள்ள முழு எண் மதிப்புக்கு வட்டமானது)

source: Number of spring "swings".
ta: வசந்த "ஊசலாட்டங்களின்" எண்ணிக்கை.

source: Name of sample to be played
ta: விளையாட வேண்டிய மாதிரியின் பெயர்

source: Name of tone to be played
ta: விளையாட வேண்டிய தொனியின் பெயர்

source: PLAY_SAMPLE (optional) channel can be one of: EFFECT/FX, BACKGROUND/BG ,MUSIC/MUS, FOREGROUND/FG, INTERFACE/UI, INPUT, ALERT
ta: Play_sample (விரும்பினால்) சேனல் ஒன்றாகும்: விளைவு/FX, பின்னணி/பி.சி, இசை/மச், முன்புறம்/எஃப்சி, இடைமுகம்/யுஐ, உள்ளீடு, எச்சரிக்கை

source: Range of tone playing from 0.1 to 10 seconds.
ta: 0.1 முதல் 10 வினாடிகள் வரை விளையாடும் தொனி வரம்பு.

source: Range of sample playing speed is from 0 to 100.
ta: மாதிரி விளையாட்டு வேகத்தின் வரம்பு 0 முதல் 100 வரை.

source: Defines a new parameter. The value is the string specified next to it.
ta: புதிய அளவுருவை வரையறுக்கிறது. மதிப்பு என்பது அதற்கு அடுத்ததாக குறிப்பிடப்பட்டுள்ள சரம்.

source: Provides a descriptive name for the effect of the color class
ta: வண்ண வகுப்பின் விளைவுக்கு விளக்கமான பெயரை வழங்குகிறது

source: Font description in fontconfig format. For example, "Sans:style=Italic:lang=hi" or "Serif:style=Bold".Warning! All font names shouldn't contain spaces.Font name "Times New Roman" should be written as "TimesNewRoman"!
ta: எழுத்துரு விளக்கம் fontConfig வடிவத்தில். எடுத்துக்காட்டாக, "சான்ச்: பாணி = இத்தாலிக்: லாங் = ஆய்" அல்லது "செரிஃப்: பாணி = தைரியமான". எல்லா எழுத்துரு பெயர்களும் இடைவெளிகளைக் கொண்டிருக்கக்கூடாது. "டைம்ச் புதிய ரோமன்" என்ற பெயரில் "டைம்செவ்மான்" என்று எழுதப்பட வேண்டும்!

source: Overrides the weight defined in "font". For example, the value "Bold" is the same as font value "style=Bold".
ta: "எழுத்துரு" இல் வரையறுக்கப்பட்ட எடையை மீறுகிறது. எடுத்துக்காட்டாக, "தைரியமான" மதிப்பு எழுத்துரு மதிப்பு "பாணி = தைரியமான" போன்றது.

source: Overrides the width defined in "font". For example, the value "Condensed" is the same as font value "style=Condensed".
ta: "எழுத்துரு" இல் வரையறுக்கப்பட்ட அகலத்தை மீறுகிறது. எடுத்துக்காட்டாக, "மின்தேக்கி" மதிப்பு எழுத்துரு மதிப்பு "பாணி = மின்தேக்கி" போன்றது.

source: Text color. Color can be chosen using the color selector UI tool.
ta: உரை நிறம். வண்ண தேர்வாளர் இடைமுகம் கருவியைப் பயன்படுத்தி வண்ணத்தைத் தேர்வு செய்யலாம்.

source: The font size in points.
ta: புள்ளிகளில் எழுத்துரு அளவு.

source: Sets the horizontal alignment of the text.<br> * auto - Respects LTR/RTL settings.<br> * center - Centers the text in the line.<br> * middle - Alias for "center"<br> * left - Aligns the text left.<br> * right - Aligns the text right.<br>
ta: உரையின் கிடைமட்ட சீரமைப்பை அமைக்கிறது. <br> * ஆட்டோ - எல்.டி.ஆர்/ஆர்.டி.எல் அமைப்புகளை மதிக்கிறது. உரையை இடதுபுறமாக சீரமைக்கிறது. <br> * வலது - உரையை வலதுபுறமாக சீரமைக்கிறது. <br>

source: Sets the vertical alignment of the text.<br> * top - Puts text at the top of the line.<br> * center - Centers the text in the line.<br> * middle - Alias for "center"<br> * bottom - Puts the text at the bottom of the line.<br> * baseline - Baseline<br> * base - Alias for "baseline"
ta: உரையின் செங்குத்து சீரமைப்பை அமைக்கிறது. <br> * மேல் - உரையை வரியின் மேற்புறத்தில் வைக்கிறது. * கீழே - உரையை வரியின் அடிப்பகுதியில் வைக்கிறது. <br> * அடிப்படை - அடிப்படை <br> * அடிப்படை - "அடிப்படை" என்பதற்கான மாற்றுப்பெயர்

source: Sets the left margin of the text in pixel.
ta: உரையின் இடது விளிம்பை பிக்சலில் அமைக்கிறது.

source: Sets the right margin of the text in pixel.
ta: உரையின் சரியான விளிம்பை பிக்சலில் அமைக்கிறது.

source: Sets the wrap policy of the text.<br> * word - Only wraps lines at word boundaries.<br> * char - Wraps at any character.<br> * mixed - Wrap at words if possible, if not, at any character.<br> * hyphenation - Hyphenate if possible, if not, wrap at words if possible,<br> if not, at any character.
ta: உரையின் மடக்கு கொள்கையை அமைக்கிறது. <br> * சொல் - சொல் எல்லைகளில் மட்டுமே கோடுகளை மூடுகிறது. .

source: Sets the size of the tab character. The value must be a number greater than 1.
ta: தாவல் எழுத்தின் அளவை அமைக்கிறது. மதிப்பு 1 ஐ விட அதிகமான எண்ணாக இருக்க வேண்டும்.

source: Sets the size of line of text.
ta: உரையின் வரியின் அளவை அமைக்கிறது.

source: Enables or disables the background color.
ta: பின்னணி நிறத்தை இயக்குகிறது அல்லது முடக்குகிறது.

source: Sets a background color for text.
ta: உரைக்கு பின்னணி நிறத்தை அமைக்கிறது.

source: Sets if the text is being used for passwords. Enabling this causes all characters to be substituted for '*'.
ta: கடவுச்சொற்களுக்கு உரை பயன்படுத்தப்பட்டால் அமைக்கிறது. இதை செயல்படுத்துவது அனைத்து எழுத்துக்களும் '*' க்கு மாற்றாக இருக்கும்.

source: Enables or disables the ellipsis feature for text.
ta: உரைக்கான நீள்வட்ட அம்சத்தை இயக்குகிறது அல்லது முடக்குகிறது.

source: Sets the ellipsis mode. A value of 0 means ellipsizing the leftmost portion of the text first, 1 on the other hand the rightmost portion.
ta: நீள்வட்ட பயன்முறையை அமைக்கிறது. 0 இன் மதிப்பு என்பது உரையின் இடது பகுதியை முதலில் அகற்றுவதாகும், 1 மறுபுறம் வலதுபுற பகுதி.

source: A floating point value indicating the wanted size of the line relative to the calculated size.
ta: கணக்கிடப்பட்ட அளவோடு தொடர்புடைய வரியின் விரும்பிய அளவைக் குறிக்கும் மிதக்கும் புள்ளி மதிப்பு.

source: Sets the style of the text.
ta: உரையின் பாணியை அமைக்கிறது.

source: Sets the color of the text shadow.
ta: உரை நிழலின் நிறத்தை அமைக்கிறது.

source: Sets the shadow direction
ta: நிழல் திசையை அமைக்கிறது

source: Sets the outer shadow glow color.
ta: வெளிப்புற நிழல் பளபளப்பான நிறத்தை அமைக்கிறது.

source: Sets the inner shadow glow color.
ta: உள் நிழல் பளபளப்பான நிறத்தை அமைக்கிறது.

source: Sets if the text is striked through.
ta: உரை மூலம் தாக்கப்பட்டால் அமைக்கிறது.

source: Sets the color of the text that is striked through.
ta: மூலம் தாக்கப்பட்ட உரையின் நிறத்தை அமைக்கிறது.

source: Sets if and how a text is underlined.
ta: ஒரு உரை எவ்வாறு அடிக்கோடிட்டுக் காட்டப்படுகிறது என்பதை அமைக்கிறது.

source: Sets the color of the underline.
ta: அடித்தளத்தின் நிறத்தை அமைக்கிறது.

source: Sets the color of the second line of the underline when using the "double" underline mode.
ta: "இரட்டை" அடிக்கோடிட்ட பயன்முறையைப் பயன்படுத்தும் போது அடிக்குறிப்பின் இரண்டாவது வரியின் நிறத்தை அமைக்கிறது.

source: Sets the width of the underline dash.
ta: அடிக்கோடிட்டுக் காட்டின் அகலத்தை அமைக்கிறது.

source: Sets the gap of the underline dash.
ta: அடிக்கோடிட்டுக் காட்டின் இடைவெளியை அமைக்கிறது.

source: Sets the color of dashed underline.
ta: கோடுள்ள அடிக்கோடிட்டுக் காட்டப்பட்ட வண்ணத்தை அமைக்கிறது.

source: Project open
ta: திட்ட திறந்த

source: Given project is dameged. Do you want to recover project?
ta: கொடுக்கப்பட்ட திட்டம் சேதமடைந்துள்ளது. திட்டத்தை மீட்டெடுக்க விரும்புகிறீர்களா?

source: The given file is locked by another application
ta: கொடுக்கப்பட்ட கோப்பு மற்றொரு பயன்பாட்டால் பூட்டப்பட்டுள்ளது

source: Confirm clear recent list
ta: தெளிவான அண்மைக் கால பட்டியலை உறுதிப்படுத்தவும்

source: Are you sure you want to clear list of recently opened projects?<br>
ta: அண்மைக் காலத்தில் திறக்கப்பட்ட திட்டங்களின் பட்டியலை அழிக்க விரும்புகிறீர்களா? <br>

source: Open recent
ta: அண்மைக் கால திறப்பு

source: Clear list
ta: தெளிவான பட்டியல்

source: Open
ta: திற

source: Project info
ta: திட்ட செய்தி

source: Part '%s' width: %d
ta: பகுதி ' %s' அகலம்: %d

source: Part '%s' heigth: %d
ta: பகுதி ' %s' எய்ட்: %d

source: Part '%s' object area width: %d
ta: பகுதி ' %s' பொருள் பகுதி அகலம்: %d

source: Part '%s' object area heigth: %d
ta: பகுதி ' %s' பொருள் பகுதி எய்ட்: %d

source: Part '%s'
ta: பகுதி '%s'

source: Absolute scale
ta: முழுமையான அளவு

source: Relative scale
ta: உறவினர் அளவு

source: Both scales
ta: இரண்டு செதில்களும்

source: Markers
ta: குறிப்பான்கள்

source: max size changed from [%dx%d] to [%dx%d]
ta: அதிகபட்ச அளவு [%dx%d] இலிருந்து [%dx%d] ஆக மாற்றப்பட்டது]

source: align changed from [%fx%f] to [%fx%f]
ta: சீரமை [%fx%f] இலிருந்து [%fx%f க்கு மாற்றப்பட்டது

source: Library
ta: நூலகம்

source: Project is changed
ta: திட்டம் மாற்றப்பட்டுள்ளது

source: Reload
ta: ஏற்றவும்

source: State set
ta: மாநில தொகுப்பு

source: Signal emit
ta: சமிக்ஞை உமிழ்வு

source: Drag value set
ta: இழுவை மதிப்பு தொகுப்பு

source: Drag value step
ta: இழுவை மதிப்பு படி

source: Drag value page
ta: இழுவை மதிப்பு பக்கம்

source: Play sample
ta: மாதிரி விளையாடுங்கள்

source: Play tone
ta: தொனி விளையாடுங்கள்

source: Action stop
ta: செயல் நிறுத்தம்

source: items
ta: உருப்படிகள்

source: Parts
ta: பாகங்கள்

source: Programs
ta: திட்டங்கள்

source: Data items
ta: தரவு உருப்படிகள்

source: Select the name of the source group.
ta: மூலக் குழுவின் பெயரைத் தேர்ந்தெடுக்கவும்.

source: copied new part "%s" from "%s"
ta: "%s" இலிருந்து புதிய பகுதியை "%s" நகலெடுத்தது

source: added new part "%s"
ta: புதிய பகுதி "%s" சேர்க்கப்பட்டது

source: Part name
ta: பகுதி பெயர்

source: Enter the name of the new part
ta: புதிய பகுதியின் பெயரை உள்ளிடவும்

source: Part type
ta: பகுதி வகை

source: Part copy
ta: பகுதி நகல்

source: Add New Part to Group "%s"
ta: குழுவில் "%s" க்கு புதிய பகுதியைச் சேர்க்கவும்

source: added new data item "%s"
ta: புதிய தரவு உருப்படி "%s" சேர்க்கப்பட்டது

source: Data item name
ta: தரவு உருப்படி பெயர்

source: Enter the name of the new group_data
ta: புதிய குழு_டேட்டாவின் பெயரை உள்ளிடவும்

source: Add New Data Item to Group "%s"
ta: "%s" குழுவில் புதிய தரவு உருப்படியைச் சேர்க்கவும்

source: added new state "%s" %.2f
ta: புதிய மாநில " %s" %.2f சேர்க்கப்பட்டது

source: added new state "%s" %.2f as copy of "%s" %.2f
ta: " %s" %.2f இன் நகலாகப் புதிய நிலை "%s" %.2f ஐ சேர்க்கப்பட்டது

source: State name
ta: மாநில பெயர்

source: Enter the name of the new state
ta: புதிய மாநிலத்தின் பெயரை உள்ளிடவும்

source: Value
ta: மதிப்பு

source: Available values: 0.0 - 1.0
ta: கிடைக்கும் மதிப்புகள்: 0.0 - 1.0

source: Duplicate state
ta: நகல் நிலை

source: Add New State to Part "%s"
ta: "%s" என்ற பகுதிக்கு புதிய நிலையைச் சேர்க்கவும்

source: added new item "%s" to part "%s"
ta: "%s" என்ற புதிய உருப்படி "%s" ஐச் சேர்த்தது

source: Enter the name of the new item
ta: புதிய உருப்படியின் பெயரை உள்ளிடவும்

source: Source group
ta: மூல குழு

source: Add New Item to Part "%s"
ta: புதிய உருப்படியை "%s" என்ற பகுதிக்குச் சேர்க்கவும்

source: added new program "%s"
ta: புதிய நிரலை "%s" சேர்க்கப்பட்டது

source: Program name
ta: நிரல் பெயர்

source: Enter the name of the new program
ta: புதிய திட்டத்தின் பெயரை உள்ளிடவும்

source: Action type
ta: செயல் வகை

source: Add New Program
ta: புதிய நிரலைச் சேர்க்கவும்

source: deleted program "%s"
ta: நீக்கப்பட்ட நிரல் "%s"

source: deleted group_data "%s"
ta: நீக்கப்பட்ட குழு_டேட்டா "%s"

source: deleted part "%s"
ta: நீக்கப்பட்ட பகுதி "%s"

source: deleted state "%s" %.2f
ta: நீக்கப்பட்ட நிலை " %s" %.2f

source: deleted item "%s"
ta: நீக்கப்பட்ட உருப்படி "%s"

source: part "%s" placed below part "%s" in the stack
ta: பகுதி "%s" அடுக்கில் "%s" க்கு கீழே வைக்கப்பட்டுள்ளது

source: part "%s" restacked to the top of the stack
ta: பகுதி "%s" அடுக்கின் மேற்புறத்தில் திரும்பப் பெறப்பட்டது

source: part item "%s" restacked BELOW
ta: பகுதி உருப்படி "%s" கீழே மீட்டெடுக்கப்பட்டது

source: part item "%s" restacked ABOVE
ta: பகுதி உருப்படி "%s" மேலே மீட்டெடுக்கப்பட்டது

source: Part
ta: பகுதி

source: State
ta: மாநிலம்

source: Item
ta: உருப்படி

source: Program
ta: திட்டம்

source: Data item
ta: தரவு உருப்படி

source: ERROR:
ta: பிழை:

source: ERROR: invalid options found. See --help.
ta: பிழை: தவறான விருப்பங்கள் காணப்படுகின்றன. பார்க்க -உதவி.

source: Name for new project
ta: புதிய திட்டத்திற்கான பெயர்

source: Path to project directory
ta: திட்ட கோப்பகத்திற்கான பாதை

source: Export edj file path. The path should contain the edj file name. The edj file will be write by this path on every save. If file missed will be created, if file exist, changed groups will be add.
ta: EDJ கோப்பு பாதை ஏற்றுமதி. பாதையில் EDJ கோப்பு பெயர் இருக்க வேண்டும். ஒவ்வொரு சேமிப்பிலும் EDJ கோப்பு இந்த பாதையால் எழுதப்படும். கோப்பு தவறவிட்டால், கோப்பு இருந்தால், மாற்றப்பட்ட குழுக்கள் சேர்க்கப்படும்.

source: Export edc file path. It should be path folder. On every save will generate source code of changed groups. If folder is missed it will be created, if folder exist new source code will be add.
ta: EDC கோப்பு பாதை ஏற்றுமதி. அது பாதை கோப்புறையாக இருக்க வேண்டும். ஒவ்வொரு சேமிப்பிலும் மாற்றப்பட்ட குழுக்களின் மூலக் குறியீட்டை உருவாக்கும். கோப்புறை தவறவிட்டால் அது உருவாக்கப்படும், கோப்புறை இருந்தால் புதிய மூலக் குறியீடு சேர்க்கப்படும்.

source: Only one file should be specified.
ta: ஒரு கோப்பு மட்டுமே குறிப்பிடப்பட வேண்டும்.

source: --export-edj value have not extension '.edj'. Wrong value.
ta: -எக்ச்போர்ட்-எட்சே மதிப்பு நீட்டிப்பு இல்லை '.edj'. தவறான மதிப்பு.

source: --reopen is given but file specified.
ta: -ரோபன் கொடுக்கப்பட்டுள்ளது, ஆனால் கோப்பு குறிப்பிடப்பட்டுள்ளது.

source: --reopen is given but --name specified.
ta: -ரோபன் கொடுக்கப்பட்டுள்ளது, ஆனால்-பெயர் குறிப்பிடப்பட்டுள்ளது.

source: --repoen is given but --path specified.
ta: -ரெபோன் கொடுக்கப்பட்டுள்ளது, ஆனால்-பாதை குறிப்பிடப்பட்டுள்ளது.

source: --reopen is given but --id specified.
ta: --reopen கொடுக்கப்பட்டுள்ளது ஆனால்-குறிப்பிட்டது.

source: --reopen is given but --sd specified.
ta: -ரோபன் கொடுக்கப்பட்டுள்ளது, ஆனால்--எச்டி குறிப்பிடப்பட்டுள்ளது.

source: --reopen is given but --fd specified.
ta: -ரோபன் கொடுக்கப்பட்டுள்ளது ஆனால்--எஃப்.டி குறிப்பிடப்பட்டுள்ளது.

source: --reopen is given but --dd specified.
ta: -ரோபன் கொடுக்கப்பட்டுள்ளது ஆனால்--டிடி குறிப்பிடப்பட்டுள்ளது.

source: widgets can be added only to new project.
ta: விட்செட்களை புதிய திட்டத்திற்கு மட்டுமே சேர்க்க முடியும்.

source: There are no previously opened projects yet.
ta: முன்னர் திறந்த திட்டங்கள் எதுவும் இல்லை.

source: File '%s' doesn't exists.
ta: '%s' கோப்பு இல்லை.

source: '%s' is a directory.
ta: '%s' என்பது ஒரு அடைவு.

source: *.pro file is given but --name specified.
ta: *.பிரோ கோப்பு கொடுக்கப்பட்டுள்ளது, ஆனால் -பெயர் குறிப்பிடப்பட்டுள்ளது.

source: *.pro file is given but --path specified.
ta: *.பிரோ கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் -பாதை குறிப்பிடப்பட்டுள்ளது.

source: *.pro file is given but --id specified.
ta: *.பிரோ கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் -ஐடி குறிப்பிடப்பட்டுள்ளது.

source: *.pro file is given but --sd specified.
ta: *.pro கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -எச்டி குறிப்பிடப்பட்டுள்ளது.

source: *.pro file is given but --fd specified.
ta: *.பிரோ கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -எஃப்.டி குறிப்பிடப்பட்டுள்ளது.

source: *.pro file is given but --dd specified.
ta: *.pro கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -dd குறிப்பிடப்பட்டுள்ளது.

source: *.edj file is given but --id specified.
ta: *.edj கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் -ஐடி குறிப்பிடப்பட்டுள்ளது.

source: *.edj file is given but --sd specified.
ta: *.edj கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -sd குறிப்பிடப்பட்டுள்ளது.

source: *.edj file is given but --fd specified.
ta: *.edj கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -எஃப்.டி குறிப்பிடப்பட்டுள்ளது.

source: *.edj file is given but --dd specified.
ta: *.edj கோப்பு கொடுக்கப்பட்டுள்ளது ஆனால் - -dd குறிப்பிடப்பட்டுள்ளது.

source: Wrong file extension.
ta: தவறான கோப்பு நீட்டிப்பு.

source: no file or --name are given but --path specified.
ta: கோப்பு அல்லது -பெயர் கொடுக்கப்படவில்லை ஆனால் -பாதை குறிப்பிடப்பட்டுள்ளது.

source: no file is given but --id specified.
ta: கோப்பு எதுவும் கொடுக்கப்படவில்லை, ஆனால் -ஐடி குறிப்பிடப்பட்டுள்ளது.

source: no file is given but --sd specified.
ta: எந்த கோப்பும் கொடுக்கப்படவில்லை, ஆனால் - -எச்.டி குறிப்பிடப்பட்டுள்ளது.

source: no file is given but --fd specified.
ta: எந்த கோப்பும் கொடுக்கப்படவில்லை ஆனால் - -எஃப்.டி குறிப்பிடப்பட்டுள்ளது.

source: no file is given but --dd specified.
ta: எந்த கோப்பும் கொடுக்கப்படவில்லை ஆனால் - -டிடி குறிப்பிடப்பட்டுள்ளது.
